package com.yaoan.module.econtract.service.intelligentReview;

import cn.hutool.core.collection.CollectionUtil;
import cn.hutool.core.io.IoUtil;
import cn.hutool.core.io.file.FileNameUtil;
import cn.hutool.core.util.CharsetUtil;
import cn.hutool.core.util.ObjectUtil;
import cn.hutool.core.util.StrUtil;
import cn.hutool.crypto.asymmetric.KeyType;
import cn.hutool.crypto.asymmetric.SM2;
import cn.hutool.http.HttpUtil;
import com.alibaba.fastjson.JSONObject;
import com.baomidou.mybatisplus.core.conditions.query.LambdaQueryWrapper;
import com.fasterxml.jackson.core.JsonProcessingException;
import com.fasterxml.jackson.databind.JsonNode;
import com.fasterxml.jackson.databind.ObjectMapper;
import com.fasterxml.jackson.databind.node.ObjectNode;
import com.google.gson.JsonObject;
import com.google.gson.JsonParser;
import com.yaoan.framework.common.util.io.FileUtils;
import com.yaoan.framework.common.util.json.JsonUtils;
import com.yaoan.module.econtract.api.contract.LegalismApi;
import com.yaoan.module.econtract.api.contract.SppGPTApi;
import com.yaoan.module.econtract.api.contract.dto.GetTokenDTO;
import com.yaoan.module.econtract.api.contract.dto.SppGPTDetailDTO;
import com.yaoan.module.econtract.api.contract.dto.SppGPTGetTokenDTO;
import com.yaoan.module.econtract.api.contract.dto.SppGPTResponseDTO;
import com.yaoan.module.econtract.controller.admin.contract.vo.*;
import com.yaoan.module.econtract.convert.contract.ContractConverter;
import com.yaoan.module.econtract.dal.dataobject.contract.ContractDetailsDO;
import com.yaoan.module.econtract.dal.dataobject.formconfig.FormDO;
import com.yaoan.module.econtract.dal.dataobject.formconfig.FormItemDO;
import com.yaoan.module.econtract.dal.dataobject.param.Param;
import com.yaoan.module.econtract.dal.dataobject.paramModel.ParamModel;
import com.yaoan.module.econtract.dal.mysql.contract.*;
import com.yaoan.module.econtract.dal.mysql.formconfig.FormDOMapper;
import com.yaoan.module.econtract.dal.mysql.formconfig.FormItemMapper;
import com.yaoan.module.econtract.dal.mysql.param.ParamMapper;
import com.yaoan.module.econtract.service.contract.com.cxf.client.LawyeeService;
import com.yaoan.module.econtract.service.paramModel.ParamModelMapper;
import com.yaoan.module.econtract.util.gcy.Sm4Utils;
import com.yaoan.module.infra.api.file.FileApi;
import com.yaoan.module.infra.api.file.dto.FileDTO;
import com.yaoan.module.infra.enums.FileUploadPathEnum;
import lombok.extern.slf4j.Slf4j;
import org.apache.commons.lang3.ObjectUtils;
import org.apache.commons.lang3.StringUtils;
import org.apache.cxf.jaxws.JaxWsProxyFactoryBean;
import org.springframework.mock.web.MockMultipartFile;
import org.springframework.stereotype.Service;
import org.springframework.transaction.annotation.Transactional;
import org.springframework.web.multipart.MultipartFile;
import org.w3c.dom.*;
import org.xml.sax.InputSource;

import javax.annotation.Resource;
import javax.xml.parsers.DocumentBuilder;
import javax.xml.parsers.DocumentBuilderFactory;
import java.io.*;
import java.math.BigInteger;
import java.net.HttpURLConnection;
import java.net.URL;
import java.security.MessageDigest;
import java.text.SimpleDateFormat;
import java.time.LocalDateTime;
import java.util.*;
import java.util.function.Function;
import java.util.stream.Collectors;

import static com.yaoan.module.econtract.enums.StatusConstants.SUFFIX_DOCX;
import static com.yaoan.module.econtract.enums.StatusConstants.SUFFIX_PDF;
import static com.yaoan.module.econtract.enums.StatusConstants.SUFFIX_OFD;

@Service
@Slf4j
public class IntelligentReviewServiceImpl implements IntelligentReviewService {
    @Resource
    private FileApi fileApi;
    @Resource
    private ParamModelMapper paramModelMapper;
    @Resource
    private FormItemMapper formItemMapper;
    @Resource
    private FormDOMapper formDOMapper;
    @Resource
    private ParamMapper paramMapper;
    @Resource
    private LegalismApi legalismApi;
    @Resource
    private SppGPTApi sppGPTApi;
    @Resource
    private ContractDetailsMapper contractDetailsMapper;

    @Override
    public List<JsonRespVO> toJson(ToJsonReqVO toJsonReqVO) throws Exception {
        //1.法益webservice提取信息
        Long fileId = toJsonReqVO.getFileId();
        String path = fileApi.getURL(fileId);

        String result = "";
        try {
            // 创建 Web 服务客户端代理工厂
            JaxWsProxyFactoryBean factory = new JaxWsProxyFactoryBean();
            factory.setServiceClass(LawyeeService.class);

            // 设置 Web 服务地址
            factory.setAddress("http://1.119.162.45:8370/cxf/services/lawyeeservice");

            // 创建 Web 服务客户端代理
            LawyeeService client = (LawyeeService) factory.create();
            byte[] fileBytes = readFileToByteArray(path);
            String token = "<Users>\n" + "\t<item>\n" + "\t\t<OrgID>0</OrgID>\n" + "\t\t<OrgName>最高人民法院</OrgName>\n" + "\t\t<DptName>业务部门</DptName>\n" + "\t\t<UserName>910009</UserName>\n" + "\t\t<UserID>1</UserID>\n" + "\t\t<PostID></PostID>\n" + "\t\t<DptID>1</DptID>\n" + "\t\t<PostName>专员</PostName>\n" + "\t</item>\n" + "</Users>";
            // 调用 Web 服务的方法
            result = client.getXMLByText(fileBytes, token, "bs", "1001", "{\"fileType\":\"pdf\"}");

            // 处理结果
            System.out.println("token------------------: " + token);
            System.out.println("Result from WebService------------------: " + result);
        } catch (Exception e) {
            e.printStackTrace();
        }

        //2.封装数据转换
        String xmlData = result;
        // 将JSON字符串解析为JsonObject
        JsonObject jsonObject = JsonParser.parseString(xmlData).getAsJsonObject();

        // 获取"xml"对应的值
        xmlData = jsonObject.get("xml").getAsString();
//        xmlData = "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n" +
//                "<合同基本信息 合同标识=\"e7ff8e1abe59d29c0920bd8b266foq36\" 合同编号=\"MF-2021-006\" 合同发文号=\"XX-2023-2608\" 合同名称=\"三明市花卉订购合同\" 合同封面名称原文=\"福建省三明市花卉订购合同\" 合同正文名称原文=\"三明市花卉订购合同\" 合同分类=\"订购回购合同\" 合同一级分类=\"买卖合同\" 合同二级分类=\"订购回购合同\" 合同三级分类=\"\" 是否官方范本=\"2\" 行业类别=\"143\" 文本性质=\"2\" 合同来源=\"1\" 适用方=\"各方\" 发布机构名称=\"三明市市场监督管理局\" 标准发布机构编码=\"\" 标准发布机构名称=\"三明市市场监督管理局\" 合同签署日期=\"20210209\" 合同生效日期=\"20210210\" 当事方合同签署地址=\"三明市\" 合同全文内容=\"三明市花卉订购合同&#xA;合同编号：MF-2021-006&#xA;买方：张某某&#xA;卖方：三明市花圃&#xA;根据《中华人民共和国合同法》及有关法律法规规定，买卖双方在平等、自愿、公平的基础上，经充分协商，就花卉订购事宜订立本合同。&#xA;一、花卉交售品种、数量、价格&#xA;1．卖方全年向买方交付各种花卉一千盆（枝、株），&#xA;分月分旬交售花卉的品种、数量、日期由双方另行约定。&#xA;2．花卉收购价格：买方以不低于伍拾元的保护价进行收购，或由双方于收购前按花卉等级和收购时市场收购价协商确定，但不得低于保护价。&#xA;3．花卉总价款为伍万元，由买方预付定金：壹万元；&#xA;二、质量要求&#xA;1．花卉品种的规格：&#xA;2．等级等质量要求：有国家标准的执行国家标准，未有国家标准的，按双方约定标准。&#xA;三、收购时间与方式&#xA;花卉交售时间由双方协商，买方须提前一天提出次日应交售的品种、数量，并以书面方式通知卖方。卖方交售与预约允许上下浮动10%。&#xA;四、包装要求与费用承担&#xA;买方提供包装标准及材料，负责包装费用，卖方按买方要求进行包装。&#xA;五、付款方式：&#xA;买方收货验收合格后，采用现金方式付款，最迟不得超过三天。&#xA;六、买方的权利和义务&#xA;1．及时验收卖方交售的花卉，收货后即支付花卉款。&#xA;2．确定花卉等级要按照国家规定的质量标准，不得任意压级压价。&#xA;3．有权拒收卖方交售的不符合国家行业质量标准的花卉，但必须向对方说明理由。&#xA;七、卖方的权利和义务&#xA;1．必须按照规定施用花肥花药，严禁对花卉使用违禁农药、化肥。&#xA;2．保证按合同约定的品种和数量种植花卉。&#xA;3．花卉种植如受气候条件的影响，允许在减产10%的幅度内不以违约论。&#xA;八、买方违约责任&#xA;1．没有按合同约定收购，造成花卉腐烂等损失，或故意压级压价，除赔偿卖方的损失外，应向卖方支付该批花卉总价值40%的违约金。&#xA;2．拖延支付花卉款，应参照银行关于拖延付款的规定，向卖方偿付违约金。&#xA;九、卖方违约责任&#xA;1．非因不可抗力，未完成当月合同总数量的90%，应向买方支付未完成部分花卉总价值40%的违约金。&#xA;2．交售使用违禁农药、化肥的花卉，应按该批货值40%向买方支付违约金。因此造成人身伤亡，卖方应承担一切责任。&#xA;十、不可抗力&#xA;如因不可抗力造成卖方不能按合同约定交售花卉，买方应据实减少卖方所承担的交售数量，卖方可不承担违约责任。&#xA;十一、争议解决方式&#xA;本合同在履行过程中发生争议的，由双方协商解决，如协商不成，可以依法向三明市沙县区人民法院起诉。&#xA;十二、合同期限&#xA;本合同有效期一年，自2021年2月10日至2022年2月10日止。&#xA;十三、本合同自双方签字盖章之日起生效。本合同未尽事宜，按照《合同法》等国家有关规定，经合同双方协商，作出补充协议，补充协议与本合同具有同等法律效力。&#xA;本合同一式二份，合同双方各执一份。&#xA;甲方：张某某（签章）&#xA;乙方：三明市花圃（签章）&#xA;签订日期：2021年2月9日\">\n" +
//                "\t<合同当事人 当事人姓名或名称=\"张某某\" 自然人证照类型=\"身份证\" 自然人证照号码=\"110110199001011100\" 统一社会信用代码=\"\" 当事人类别=\"3\" 所属方类型=\"1\" 当事人身份=\"买方\" 法定代表人或负责人=\"\" 代理人类型=\"2\" 代理人姓名=\"张某胜\" 代理人身份或职务=\"\" 当事人简称=\"\" 联系地址=\"三明市沙县区\" 联系方式=\"138****5647\" 联系人=\"张某胜\" 当事方合同签署日期=\"20210209\" 当事方合同签署地址=\"三明市三元区\"/>\n" +
//                "\t<合同当事人 当事人姓名或名称=\"三明市花圃\" 自然人证照类型=\"\" 自然人证照号码=\"\" 统一社会信用代码=\"220220190020203366\" 当事人类别=\"1\" 所属方类型=\"2\" 当事人身份=\"卖方\" 法定代表人或负责人=\"王某鹏\" 代理人类型=\"1\" 代理人姓名=\"王某飞\" 代理人身份或职务=\"销售经理\" 当事人简称=\"三明市花圃\" 联系地址=\"三明市三元区\" 联系方式=\"0598-***805\" 联系人=\"王某飞\" 当事方合同签署日期=\"20210208\" 当事方合同签署地址=\"三明市三元区\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"1\" 段落编项=\"\" 段落编项原文=\"\" 合同全文结构一级分段=\"3\" 段落框架结构=\"合同名称\" 段落内容=\"三明市花卉订购合同\" 段落字数=\"9\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"2\" 段落编项=\"\" 段落编项原文=\"\" 合同全文结构一级分段=\"4\" 段落框架结构=\"合同首部\" 段落内容=\"合同编号：MF-2021-006\" 段落字数=\"16\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"3\" 段落编项=\"\" 段落编项原文=\"\" 合同全文结构一级分段=\"4\" 段落框架结构=\"合同当事人\" 段落内容=\"买方：张某某\" 段落字数=\"6\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"4\" 段落编项=\"\" 段落编项原文=\"\" 合同全文结构一级分段=\"4\" 段落框架结构=\"合同当事人\" 段落内容=\"卖方：三明市花圃\" 段落字数=\"8\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"5\" 段落编项=\"\" 段落编项原文=\"\" 合同全文结构一级分段=\"6\" 段落框架结构=\"合同正文\" 段落内容=\"根据《中华人民共和国合同法》及有关法律法规规定，买卖双方在平等、自愿、公平的基础上，经充分协商，就花卉订购事宜订立本合同。\" 段落字数=\"61\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"6\" 段落编项=\"第1条\" 段落编项原文=\"一\" 合同全文结构一级分段=\"6\" 段落框架结构=\"条\" 段落内容=\"一、花卉交售品种、数量、价格\" 段落字数=\"14\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"7\" 段落编项=\"第1条第1款\" 段落编项原文=\"1\" 合同全文结构一级分段=\"6\" 段落框架结构=\"款\" 段落内容=\"1．卖方全年向买方交付各种花卉一千盆（枝、株），\" 段落字数=\"24\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"8\" 段落编项=\"第1条第1款\" 段落编项原文=\"\" 合同全文结构一级分段=\"6\" 段落框架结构=\"款\" 段落内容=\"分月分旬交售花卉的品种、数量、日期由双方另行约定。\" 段落字数=\"25\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"9\" 段落编项=\"第1条第2款\" 段落编项原文=\"2\" 合同全文结构一级分段=\"6\" 段落框架结构=\"款\" 段落内容=\"2．花卉收购价格：买方以不低于伍拾元的保护价进行收购，或由双方于收购前按花卉等级和收购时市场收购价协商确定，但不得低于保护价。\" 段落字数=\"63\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"10\" 段落编项=\"第1条第3款\" 段落编项原文=\"3\" 合同全文结构一级分段=\"6\" 段落框架结构=\"款\" 段落内容=\"3．花卉总价款为伍万元，由买方预付定金：壹万元；\" 段落字数=\"24\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"11\" 段落编项=\"第2条\" 段落编项原文=\"二\" 合同全文结构一级分段=\"6\" 段落框架结构=\"条\" 段落内容=\"二、质量要求\" 段落字数=\"6\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"12\" 段落编项=\"第2条第1款\" 段落编项原文=\"1\" 合同全文结构一级分段=\"6\" 段落框架结构=\"款\" 段落内容=\"1．花卉品种的规格：\" 段落字数=\"10\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"13\" 段落编项=\"第2条第2款\" 段落编项原文=\"2\" 合同全文结构一级分段=\"6\" 段落框架结构=\"款\" 段落内容=\"2．等级等质量要求：有国家标准的执行国家标准，未有国家标准的，按双方约定标准。\" 段落字数=\"39\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"14\" 段落编项=\"第3条\" 段落编项原文=\"三\" 合同全文结构一级分段=\"6\" 段落框架结构=\"条\" 段落内容=\"三、收购时间与方式\" 段落字数=\"9\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"15\" 段落编项=\"第3条第1款\" 段落编项原文=\"\" 合同全文结构一级分段=\"6\" 段落框架结构=\"款\" 段落内容=\"花卉交售时间由双方协商，买方须提前一天提出次日应交售的品种、数量，并以书面方式通知卖方。卖方交售与预约允许上下浮动10%。\" 段落字数=\"61\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"16\" 段落编项=\"第4条\" 段落编项原文=\"四\" 合同全文结构一级分段=\"6\" 段落框架结构=\"条\" 段落内容=\"四、包装要求与费用承担\" 段落字数=\"11\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"17\" 段落编项=\"第4条第1款\" 段落编项原文=\"\" 合同全文结构一级分段=\"6\" 段落框架结构=\"款\" 段落内容=\"买方提供包装标准及材料，负责包装费用，卖方按买方要求进行包装。\" 段落字数=\"31\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"18\" 段落编项=\"第5条\" 段落编项原文=\"五\" 合同全文结构一级分段=\"6\" 段落框架结构=\"条\" 段落内容=\"五、付款方式：\" 段落字数=\"7\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"19\" 段落编项=\"第5条第1款\" 段落编项原文=\"\" 合同全文结构一级分段=\"6\" 段落框架结构=\"款\" 段落内容=\"买方收货验收合格后，采用现金方式付款，最迟不得超过三天。\" 段落字数=\"28\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"20\" 段落编项=\"第6条\" 段落编项原文=\"六\" 合同全文结构一级分段=\"6\" 段落框架结构=\"条\" 段落内容=\"六、买方的权利和义务\" 段落字数=\"10\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"21\" 段落编项=\"第6条第1款\" 段落编项原文=\"1\" 合同全文结构一级分段=\"6\" 段落框架结构=\"款\" 段落内容=\"1．及时验收卖方交售的花卉，收货后即支付花卉款。\" 段落字数=\"24\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"22\" 段落编项=\"第6条第2款\" 段落编项原文=\"2\" 合同全文结构一级分段=\"6\" 段落框架结构=\"款\" 段落内容=\"2．确定花卉等级要按照国家规定的质量标准，不得任意压级压价。\" 段落字数=\"30\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"23\" 段落编项=\"第6条第3款\" 段落编项原文=\"3\" 合同全文结构一级分段=\"6\" 段落框架结构=\"款\" 段落内容=\"3．有权拒收卖方交售的不符合国家行业质量标准的花卉，但必须向对方说明理由。\" 段落字数=\"37\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"24\" 段落编项=\"第7条\" 段落编项原文=\"七\" 合同全文结构一级分段=\"6\" 段落框架结构=\"条\" 段落内容=\"七、卖方的权利和义务\" 段落字数=\"10\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"25\" 段落编项=\"第7条第1款\" 段落编项原文=\"1\" 合同全文结构一级分段=\"6\" 段落框架结构=\"款\" 段落内容=\"1．必须按照规定施用花肥花药，严禁对花卉使用违禁农药、化肥。\" 段落字数=\"30\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"26\" 段落编项=\"第7条第2款\" 段落编项原文=\"2\" 合同全文结构一级分段=\"6\" 段落框架结构=\"款\" 段落内容=\"2．保证按合同约定的品种和数量种植花卉。\" 段落字数=\"20\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"27\" 段落编项=\"第7条第3款\" 段落编项原文=\"3\" 合同全文结构一级分段=\"6\" 段落框架结构=\"款\" 段落内容=\"3．花卉种植如受气候条件的影响，允许在减产10%的幅度内不以违约论。\" 段落字数=\"34\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"28\" 段落编项=\"第8条\" 段落编项原文=\"八\" 合同全文结构一级分段=\"6\" 段落框架结构=\"条\" 段落内容=\"八、买方违约责任\" 段落字数=\"8\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"29\" 段落编项=\"第8条第1款\" 段落编项原文=\"1\" 合同全文结构一级分段=\"6\" 段落框架结构=\"款\" 段落内容=\"1．没有按合同约定收购，造成花卉腐烂等损失，或故意压级压价，除赔偿卖方的损失外，应向卖方支付该批花卉总价值40%的违约金。\" 段落字数=\"61\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"30\" 段落编项=\"第8条第2款\" 段落编项原文=\"2\" 合同全文结构一级分段=\"6\" 段落框架结构=\"款\" 段落内容=\"2．拖延支付花卉款，应参照银行关于拖延付款的规定，向卖方偿付违约金。\" 段落字数=\"34\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"31\" 段落编项=\"第9条\" 段落编项原文=\"九\" 合同全文结构一级分段=\"6\" 段落框架结构=\"条\" 段落内容=\"九、卖方违约责任\" 段落字数=\"8\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"32\" 段落编项=\"第9条第1款\" 段落编项原文=\"1\" 合同全文结构一级分段=\"6\" 段落框架结构=\"款\" 段落内容=\"1．非因不可抗力，未完成当月合同总数量的90%，应向买方支付未完成部分花卉总价值40%的违约金。\" 段落字数=\"48\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"33\" 段落编项=\"第9条第2款\" 段落编项原文=\"2\" 合同全文结构一级分段=\"6\" 段落框架结构=\"款\" 段落内容=\"2．交售使用违禁农药、化肥的花卉，应按该批货值40%向买方支付违约金。因此造成人身伤亡，卖方应承担一切责任。\" 段落字数=\"54\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"34\" 段落编项=\"第10条\" 段落编项原文=\"十\" 合同全文结构一级分段=\"6\" 段落框架结构=\"条\" 段落内容=\"十、不可抗力\" 段落字数=\"6\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"35\" 段落编项=\"第10条第1款\" 段落编项原文=\"\" 合同全文结构一级分段=\"6\" 段落框架结构=\"款\" 段落内容=\"如因不可抗力造成卖方不能按合同约定交售花卉，买方应据实减少卖方所承担的交售数量，卖方可不承担违约责任。\" 段落字数=\"51\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"36\" 段落编项=\"第11条\" 段落编项原文=\"十一\" 合同全文结构一级分段=\"6\" 段落框架结构=\"条\" 段落内容=\"十一、争议解决方式\" 段落字数=\"9\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"37\" 段落编项=\"第11条第1款\" 段落编项原文=\"\" 合同全文结构一级分段=\"6\" 段落框架结构=\"款\" 段落内容=\"本合同在履行过程中发生争议的，由双方协商解决，如协商不成，可以依法向三明市沙县区人民法院起诉。\" 段落字数=\"47\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"38\" 段落编项=\"第12条\" 段落编项原文=\"十二\" 合同全文结构一级分段=\"6\" 段落框架结构=\"条\" 段落内容=\"十二、合同期限\" 段落字数=\"7\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"39\" 段落编项=\"第12条第1款\" 段落编项原文=\"\" 合同全文结构一级分段=\"6\" 段落框架结构=\"款\" 段落内容=\"本合同有效期一年，自2021年2月10日至2022年2月10日止。\" 段落字数=\"33\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"40\" 段落编项=\"第13条\" 段落编项原文=\"十三\" 合同全文结构一级分段=\"6\" 段落框架结构=\"条\" 段落内容=\"十三、本合同自双方签字盖章之日起生效。本合同未尽事宜，按照《合同法》等国家有关规定，经合同双方协商，作出补充协议，补充协议与本合同具有同等法律效力。\" 段落字数=\"74\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"41\" 段落编项=\"第13条第1款\" 段落编项原文=\"\" 合同全文结构一级分段=\"6\" 段落框架结构=\"款\" 段落内容=\"本合同一式二份，合同双方各执一份。\" 段落字数=\"17\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"42\" 段落编项=\"\" 段落编项原文=\"\" 合同全文结构一级分段=\"8\" 段落框架结构=\"合同尾部\" 段落内容=\"甲方：张某某（签章）\" 段落字数=\"10\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"43\" 段落编项=\"\" 段落编项原文=\"\" 合同全文结构一级分段=\"8\" 段落框架结构=\"合同尾部\" 段落内容=\"乙方：三明市花圃（签章）\" 段落字数=\"12\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"44\" 段落编项=\"\" 段落编项原文=\"\" 合同全文结构一级分段=\"8\" 段落框架结构=\"合同尾部\" 段落内容=\"签订日期：2021年2月9日\" 段落字数=\"14\"/>\n" +
//                "\t<合同条文信息 合同条文标识=\"\" 合同条文顺序号=\"1\" 合同条文编项=\"第1条\" 段落内容=\"一、花卉交售品种、数量、价格&#xA;1．卖方全年向买方交付各种花卉一千盆（枝、株），&#xA;分月分旬交售花卉的品种、数量、日期由双方另行约定。&#xA;2．花卉收购价格：买方以不低于伍拾元的保护价进行收购，或由双方于收购前按花卉等级和收购时市场收购价协商确定，但不得低于保护价。&#xA;3．花卉总价款为伍万元，由买方预付定金：壹万元；\" 合同条文一级分类=\"标的条款\" 合同条文二级分类=\"标的基本信息条款\"/>\n" +
//                "\t<合同条文信息 合同条文标识=\"\" 合同条文顺序号=\"2\" 合同条文编项=\"第2条\" 段落内容=\"二、质量要求&#xA;1．花卉品种的规格：&#xA;2．等级等质量要求：有国家标准的执行国家标准，未有国家标准的，按双方约定标准。\" 合同条文一级分类=\"标的条款\" 合同条文二级分类=\"标的质量条款\"/>\n" +
//                "\t<合同条文信息 合同条文标识=\"\" 合同条文顺序号=\"3\" 合同条文编项=\"第3条\" 段落内容=\"三、收购时间与方式&#xA;花卉交售时间由双方协商，买方须提前一天提出次日应交售的品种、数量，并以书面方式通知卖方。卖方交售与预约允许上下浮动10%。\" 合同条文一级分类=\"履行\" 合同条文二级分类=\"履行方式\">\n" +
//                "\t\t<合同要素信息 合同要素名称=\"履约时间通知方式\" 合同要素取值=\"书面\"/>\n" +
//                "\t</合同条文信息>\n" +
//                "\t<合同条文信息 合同条文标识=\"\" 合同条文顺序号=\"4\" 合同条文编项=\"第4条\" 段落内容=\"四、包装要求与费用承担&#xA;买方提供包装标准及材料，负责包装费用，卖方按买方要求进行包装。\" 合同条文一级分类=\"标的条款\" 合同条文二级分类=\"标的包装方式条款\">\n" +
//                "\t\t<合同要素信息 合同要素名称=\"包装费用承担方\" 合同要素取值=\"买方\"/>\n" +
//                "\t</合同条文信息>\n" +
//                "\t<合同条文信息 合同条文标识=\"\" 合同条文顺序号=\"5\" 合同条文编项=\"第5条\" 段落内容=\"五、付款方式：&#xA;买方收货验收合格后，采用现金方式付款，最迟不得超过三天。\" 合同条文一级分类=\"价款及结算方式条款\" 合同条文二级分类=\"结算方式条款\">\n" +
//                "\t\t<合同要素信息 合同要素名称=\"付款方式\" 合同要素取值=\"现金\"/>\n" +
//                "\t</合同条文信息>\n" +
//                "\t<合同条文信息 合同条文标识=\"\" 合同条文顺序号=\"6\" 合同条文编项=\"第6条\" 段落内容=\"六、买方的权利和义务&#xA;1．及时验收卖方交售的花卉，收货后即支付花卉款。&#xA;2．确定花卉等级要按照国家规定的质量标准，不得任意压级压价。&#xA;3．有权拒收卖方交售的不符合国家行业质量标准的花卉，但必须向对方说明理由。\" 合同条文一级分类=\"法律效力条款\" 合同条文二级分类=\"\"/>\n" +
//                "\t<合同条文信息 合同条文标识=\"\" 合同条文顺序号=\"7\" 合同条文编项=\"第7条\" 段落内容=\"七、卖方的权利和义务&#xA;1．必须按照规定施用花肥花药，严禁对花卉使用违禁农药、化肥。&#xA;2．保证按合同约定的品种和数量种植花卉。&#xA;3．花卉种植如受气候条件的影响，允许在减产10%的幅度内不以违约论。\" 合同条文一级分类=\"法律效力条款\" 合同条文二级分类=\"\"/>\n" +
//                "\t<合同条文信息 合同条文标识=\"\" 合同条文顺序号=\"8\" 合同条文编项=\"第8条\" 段落内容=\"八、买方违约责任&#xA;1．没有按合同约定收购，造成花卉腐烂等损失，或故意压级压价，除赔偿卖方的损失外，应向卖方支付该批花卉总价值40%的违约金。&#xA;2．拖延支付花卉款，应参照银行关于拖延付款的规定，向卖方偿付违约金。\" 合同条文一级分类=\"违约责任条款\" 合同条文二级分类=\"违约金条款\"/>\n" +
//                "\t<合同条文信息 合同条文标识=\"\" 合同条文顺序号=\"9\" 合同条文编项=\"第9条\" 段落内容=\"九、卖方违约责任&#xA;1．非因不可抗力，未完成当月合同总数量的90%，应向买方支付未完成部分花卉总价值40%的违约金。&#xA;2．交售使用违禁农药、化肥的花卉，应按该批货值40%向买方支付违约金。因此造成人身伤亡，卖方应承担一切责任。\" 合同条文一级分类=\"违约责任条款\" 合同条文二级分类=\"违约金条款\"/>\n" +
//                "\t<合同条文信息 合同条文标识=\"\" 合同条文顺序号=\"10\" 合同条文编项=\"第10条\" 段落内容=\"十、不可抗力&#xA;如因不可抗力造成卖方不能按合同约定交售花卉，买方应据实减少卖方所承担的交售数量，卖方可不承担违约责任。\" 合同条文一级分类=\"不可抗力条款\" 合同条文二级分类=\"\"/>\n" +
//                "\t<合同条文信息 合同条文标识=\"\" 合同条文顺序号=\"11\" 合同条文编项=\"第11条\" 段落内容=\"十一、争议解决方式&#xA;本合同在履行过程中发生争议的，由双方协商解决，如协商不成，可以依法向三明市沙县区人民法院起诉。\" 合同条文一级分类=\"争议解决条款\" 合同条文二级分类=\"\">\n" +
//                "\t\t<合同要素信息 合同要素名称=\"争议解决方式\" 合同要素取值=\"协商或起诉\"/>\n" +
//                "\t</合同条文信息>\n" +
//                "\t<合同条文信息 合同条文标识=\"\" 合同条文顺序号=\"12\" 合同条文编项=\"第12条\" 段落内容=\"十二、合同期限&#xA;本合同有效期一年，自2021年2月10日至2022年2月10日止。\" 合同条文一级分类=\"生效和有效期条款\" 合同条文二级分类=\"\"/>\n" +
//                "\t<合同条文信息 合同条文标识=\"\" 合同条文顺序号=\"13\" 合同条文编项=\"第13条\" 段落内容=\"十三、本合同自双方签字盖章之日起生效。本合同未尽事宜，按照《合同法》等国家有关规定，经合同双方协商，作出补充协议，补充协议与本合同具有同等法律效力。&#xA;本合同一式二份，合同双方各执一份。\" 合同条文一级分类=\"合同签约份数条款\" 合同条文二级分类=\"\"/>\n" +
//                "\t<引用法律法规信息 引用法律法规名称=\"中华人民共和国合同法\" 引用条款编项=\"第六十二条第一项\" 引用条=\"第六十二条\" 引用法条内容=\"当事人就有关合同内容约定不明确，依照本法第六十一条的规定仍不能确定的，适用下列规定：&#xA;（一）质量要求不明确的，按照国家标准、行业标准履行；没有国家标准、行业标准的，按照通常标准或者符合合同目的的特定标准履行。\" 引用款=\"\" 引用项=\"第一项\" 引用目=\"\"/>\n" +
//                "\t<引用法律法规信息 引用法律法规名称=\"中华人民共和国合同法\" 引用条款编项=\"第一百二十八条\" 引用条=\"第一百二十八条\" 引用法条内容=\"当事人可以通过和解或者调解解决合同争议。当事人不愿和解、调解或者和解、调解不成的，可以根据仲裁协议向仲裁机构申请仲裁。涉外合同的当事人可以根据仲裁协议向中国仲裁机构或者其他仲裁机构申请仲裁。当事人没有订立仲裁协议或者仲裁协议无效的，可以向人民法院起诉。当事人应当履行发生法律效力的判决、仲裁裁决、调解书；拒不履行的，对方可以请求人民法院执行。\" 引用款=\"\" 引用项=\"\" 引用目=\"\"/>\n" +
//                "\t<履约信息 履约主体姓名或名称=\"三明市花圃\" 履约内容原文=\"卖方全年向买方交付各种花卉一千盆（枝、株），&#xA;分月分旬交售花卉的品种、数量、日期由双方另行约定。\" 履约内容类型=\"2\" 履约金额原文=\"\" 履约金额=\"\" 履约金额币种=\"\" 履约时间原文=\"全年\" 履约时间日期=\"\" 履约时间期限=\"360\"/>\n" +
//                "\t<履约信息 履约主体姓名或名称=\"张某某\" 履约内容原文=\"花卉总价款为伍万元，由买方预付定金：壹万元；\" 履约内容类型=\"1\" 履约金额原文=\"壹万元\" 履约金额=\"10000\" 履约金额币种=\"人民币\" 履约时间原文=\"\" 履约时间日期=\"\" 履约时间期限=\"\"/>\n" +
//                "\t<履约信息 履约主体姓名或名称=\"张某某\" 履约内容原文=\"买方收货验收合格后，采用现金方式付款，最迟不得超过三天。\" 履约内容类型=\"1\" 履约金额原文=\"\" 履约金额=\"\" 履约金额币种=\"\" 履约时间原文=\"最迟不得超过三天\" 履约时间日期=\"\" 履约时间期限=\"3\"/>\n" +
//                "\t<履约信息 履约主体姓名或名称=\"张某某\" 履约内容原文=\"花卉交售时间由双方协商，买方须提前一天提出次日应交售的品种、数量，并以书面方式通知卖方。\" 履约内容类型=\"5\" 履约金额原文=\"\" 履约金额=\"\" 履约金额币种=\"\" 履约时间原文=\"提前一天\" 履约时间日期=\"\" 履约时间期限=\"1\"/>\n" +
//                "\t<履约信息 履约主体姓名或名称=\"三明市花圃\" 履约内容原文=\"卖方按买方要求进行包装。\" 履约内容类型=\"5\" 履约金额原文=\"\" 履约金额=\"\" 履约金额币种=\"\" 履约时间原文=\"\" 履约时间日期=\"\" 履约时间期限=\"\"/>\n" +
//                "</合同基本信息>\n";
        //创建返回list
        List<JsonRespVO> resultList = new ArrayList<>();

        try {
            DocumentBuilderFactory factory = DocumentBuilderFactory.newInstance();
            DocumentBuilder builder = factory.newDocumentBuilder();
            Document document = builder.parse(new InputSource(new StringReader(xmlData)));

            // 创建JSON对象
            ObjectMapper mapper = new ObjectMapper();
            ObjectNode json = mapper.createObjectNode();

            //模板参数
            if (StringUtils.isNotEmpty(toJsonReqVO.getTemplateId())) {
                //获取模板绑定对应参数
                List<ParamModel> paramModelList = paramModelMapper.selectList(new LambdaQueryWrapper<ParamModel>().eq(ParamModel::getModelId, toJsonReqVO.getTemplateId()));
                //获取参数信息
                List<Param> params = paramMapper.selectList();
                //转换成map
                Map<String, Param> paramMap = params.stream().collect(Collectors.toMap(Param::getId, Function.identity()));
                //提取合同基本信息
                NodeList nodeList1 = document.getElementsByTagName("合同基本信息");
                for (int i = 0; i < nodeList1.getLength(); i++) {
                    Element element = (Element) nodeList1.item(i);
                    for (ParamModel paramModel : paramModelList) {
                        Param param = paramMap.get(paramModel.getParamId());
                        if (ObjectUtils.isNotEmpty(param)) {
                            String value = element.getAttribute(param.getName());
                            if (StringUtils.isNotEmpty(value)) {
                                resultList.add(new JsonRespVO().setName(param.getName()).setCode(param.getCode()).setValue(value));
                            }
                        }
                    }
                }


                NodeList nodeList2 = document.getElementsByTagName("合同当事人");
                for (int j = 0; j < nodeList2.getLength(); j++) {
                    Element partyElement = (Element) nodeList2.item(j);
                    for (ParamModel paramModel : paramModelList) {
                        Param param = paramMap.get(paramModel.getParamId());
                        if (ObjectUtils.isNotEmpty(param)) {
                            String value = partyElement.getAttribute(param.getName());
                            if (StringUtils.isNotEmpty(value)) {
                                resultList.add(new JsonRespVO().setName(param.getName()).setCode(param.getCode()).setValue(value));
                            }
                        }
                    }
                }

                NodeList nodeList3 = document.getElementsByTagName("履约信息");
                for (int k = 0; k < nodeList3.getLength(); k++) {
                    Element partyElement = (Element) nodeList3.item(k);
                    for (ParamModel paramModel : paramModelList) {
                        Param param = paramMap.get(paramModel.getParamId());
                        if (ObjectUtils.isNotEmpty(param)) {
                            String value = partyElement.getAttribute(param.getName());
                            if (StringUtils.isNotEmpty(value)) {
                                resultList.add(new JsonRespVO().setName(param.getName()).setCode(param.getCode()).setValue(value));
                            }
                        }
                    }
                }
                return resultList;
            }

        } catch (Exception e) {
            e.printStackTrace();
        }

        return resultList;
    }

    private static byte[] readFileToByteArray(String fileUrl) throws IOException {
//        URL url = new URL(fileUrl);
//        HttpURLConnection connection = (HttpURLConnection) url.openConnection();
//        connection.setRequestMethod("GET");
//        try (InputStream inputStream = connection.getInputStream()) {
        File file = new File(fileUrl);
        try (   InputStream inputStream = new FileInputStream(file);) {
            ByteArrayOutputStream output = new ByteArrayOutputStream();
            byte[] buffer = new byte[4096];
            int bytesRead;
            while ((bytesRead = inputStream.read(buffer)) != -1) {
                output.write(buffer, 0, bytesRead);
            }
            return output.toByteArray();
        } finally {
//            connection.disconnect();
        }
    }

    @Override
    public List<JsonFormRespVO> toJsonForm(FormToJsonReqVO formToJsonReqVO) throws Exception {
        //1.法益webservice提取信息
        Long fileId = formToJsonReqVO.getFileId();
//        String path = fileApi.getURL(fileId);

        String path = "E:\\aaaaaaaaaacs0d8226f4-6e5f-4b4d-86fc-e0bd99a92671.html";

        String result = "";
        try {
            // 创建 Web 服务客户端代理工厂
            JaxWsProxyFactoryBean factory = new JaxWsProxyFactoryBean();
            factory.setServiceClass(LawyeeService.class);

            // 设置 Web 服务地址
            factory.setAddress("http://1.119.162.45:8370/cxf/services/lawyeeservice");

            // 创建 Web 服务客户端代理
            LawyeeService client = (LawyeeService) factory.create();
            byte[] fileBytes = readFileToByteArray(path);
            String token = "<Users>\n" + "\t<item>\n" + "\t\t<OrgID>0</OrgID>\n" + "\t\t<OrgName>最高人民法院</OrgName>\n" + "\t\t<DptName>业务部门</DptName>\n" + "\t\t<UserName>910009</UserName>\n" + "\t\t<UserID>1</UserID>\n" + "\t\t<PostID></PostID>\n" + "\t\t<DptID>1</DptID>\n" + "\t\t<PostName>专员</PostName>\n" + "\t</item>\n" + "</Users>";
            // 调用 Web 服务的方法
            result = client.getXMLByText(fileBytes, token, "bs", "1001", "{\"fileType\":\"pdf\"}");

            // 处理结果
            System.out.println("token------------------: " + token);
            System.out.println("Result from WebService------------------: " + result);
        } catch (Exception e) {
            e.printStackTrace();
        }

        //2.封装数据转换
        String xmlData = result;
        // 将JSON字符串解析为JsonObject
        JsonObject jsonObject = JsonParser.parseString(xmlData).getAsJsonObject();

        // 获取"xml"对应的值
        xmlData = jsonObject.get("xml").getAsString();
//        xmlData = "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n" +
//                "<合同基本信息 合同标识=\"e7ff8e1abe59d29c0920bd8b266foq36\" 合同编号=\"MF-2021-006\" 合同发文号=\"XX-2023-2608\" 合同名称=\"三明市花卉订购合同\" 合同封面名称原文=\"福建省三明市花卉订购合同\" 合同正文名称原文=\"三明市花卉订购合同\" 合同分类=\"订购回购合同\" 合同一级分类=\"买卖合同\" 合同二级分类=\"订购回购合同\" 合同三级分类=\"\" 是否官方范本=\"2\" 行业类别=\"143\" 文本性质=\"2\" 合同来源=\"1\" 适用方=\"各方\" 发布机构名称=\"三明市市场监督管理局\" 标准发布机构编码=\"\" 标准发布机构名称=\"三明市市场监督管理局\" 合同签署日期=\"20210209\" 合同生效日期=\"20210210\" 当事方合同签署地址=\"三明市\" 合同全文内容=\"三明市花卉订购合同&#xA;合同编号：MF-2021-006&#xA;买方：张某某&#xA;卖方：三明市花圃&#xA;根据《中华人民共和国合同法》及有关法律法规规定，买卖双方在平等、自愿、公平的基础上，经充分协商，就花卉订购事宜订立本合同。&#xA;一、花卉交售品种、数量、价格&#xA;1．卖方全年向买方交付各种花卉一千盆（枝、株），&#xA;分月分旬交售花卉的品种、数量、日期由双方另行约定。&#xA;2．花卉收购价格：买方以不低于伍拾元的保护价进行收购，或由双方于收购前按花卉等级和收购时市场收购价协商确定，但不得低于保护价。&#xA;3．花卉总价款为伍万元，由买方预付定金：壹万元；&#xA;二、质量要求&#xA;1．花卉品种的规格：&#xA;2．等级等质量要求：有国家标准的执行国家标准，未有国家标准的，按双方约定标准。&#xA;三、收购时间与方式&#xA;花卉交售时间由双方协商，买方须提前一天提出次日应交售的品种、数量，并以书面方式通知卖方。卖方交售与预约允许上下浮动10%。&#xA;四、包装要求与费用承担&#xA;买方提供包装标准及材料，负责包装费用，卖方按买方要求进行包装。&#xA;五、付款方式：&#xA;买方收货验收合格后，采用现金方式付款，最迟不得超过三天。&#xA;六、买方的权利和义务&#xA;1．及时验收卖方交售的花卉，收货后即支付花卉款。&#xA;2．确定花卉等级要按照国家规定的质量标准，不得任意压级压价。&#xA;3．有权拒收卖方交售的不符合国家行业质量标准的花卉，但必须向对方说明理由。&#xA;七、卖方的权利和义务&#xA;1．必须按照规定施用花肥花药，严禁对花卉使用违禁农药、化肥。&#xA;2．保证按合同约定的品种和数量种植花卉。&#xA;3．花卉种植如受气候条件的影响，允许在减产10%的幅度内不以违约论。&#xA;八、买方违约责任&#xA;1．没有按合同约定收购，造成花卉腐烂等损失，或故意压级压价，除赔偿卖方的损失外，应向卖方支付该批花卉总价值40%的违约金。&#xA;2．拖延支付花卉款，应参照银行关于拖延付款的规定，向卖方偿付违约金。&#xA;九、卖方违约责任&#xA;1．非因不可抗力，未完成当月合同总数量的90%，应向买方支付未完成部分花卉总价值40%的违约金。&#xA;2．交售使用违禁农药、化肥的花卉，应按该批货值40%向买方支付违约金。因此造成人身伤亡，卖方应承担一切责任。&#xA;十、不可抗力&#xA;如因不可抗力造成卖方不能按合同约定交售花卉，买方应据实减少卖方所承担的交售数量，卖方可不承担违约责任。&#xA;十一、争议解决方式&#xA;本合同在履行过程中发生争议的，由双方协商解决，如协商不成，可以依法向三明市沙县区人民法院起诉。&#xA;十二、合同期限&#xA;本合同有效期一年，自2021年2月10日至2022年2月10日止。&#xA;十三、本合同自双方签字盖章之日起生效。本合同未尽事宜，按照《合同法》等国家有关规定，经合同双方协商，作出补充协议，补充协议与本合同具有同等法律效力。&#xA;本合同一式二份，合同双方各执一份。&#xA;甲方：张某某（签章）&#xA;乙方：三明市花圃（签章）&#xA;签订日期：2021年2月9日\">\n" +
//                "\t<合同当事人 当事人姓名或名称=\"张某某\" 自然人证照类型=\"身份证\" 自然人证照号码=\"110110199001011100\" 统一社会信用代码=\"\" 当事人类别=\"3\" 所属方类型=\"1\" 当事人身份=\"买方\" 法定代表人或负责人=\"\" 代理人类型=\"2\" 代理人姓名=\"张某胜\" 代理人身份或职务=\"\" 当事人简称=\"\" 联系地址=\"三明市沙县区\" 联系方式=\"138****5647\" 联系人=\"张某胜\" 当事方合同签署日期=\"20210209\" 当事方合同签署地址=\"三明市三元区\"/>\n" +
//                "\t<合同当事人 当事人姓名或名称=\"三明市花圃\" 自然人证照类型=\"\" 自然人证照号码=\"\" 统一社会信用代码=\"220220190020203366\" 当事人类别=\"1\" 所属方类型=\"2\" 当事人身份=\"卖方\" 法定代表人或负责人=\"王某鹏\" 代理人类型=\"1\" 代理人姓名=\"王某飞\" 代理人身份或职务=\"销售经理\" 当事人简称=\"三明市花圃\" 联系地址=\"三明市三元区\" 联系方式=\"0598-***805\" 联系人=\"王某飞\" 当事方合同签署日期=\"20210208\" 当事方合同签署地址=\"三明市三元区\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"1\" 段落编项=\"\" 段落编项原文=\"\" 合同全文结构一级分段=\"3\" 段落框架结构=\"合同名称\" 段落内容=\"三明市花卉订购合同\" 段落字数=\"9\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"2\" 段落编项=\"\" 段落编项原文=\"\" 合同全文结构一级分段=\"4\" 段落框架结构=\"合同首部\" 段落内容=\"合同编号：MF-2021-006\" 段落字数=\"16\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"3\" 段落编项=\"\" 段落编项原文=\"\" 合同全文结构一级分段=\"4\" 段落框架结构=\"合同当事人\" 段落内容=\"买方：张某某\" 段落字数=\"6\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"4\" 段落编项=\"\" 段落编项原文=\"\" 合同全文结构一级分段=\"4\" 段落框架结构=\"合同当事人\" 段落内容=\"卖方：三明市花圃\" 段落字数=\"8\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"5\" 段落编项=\"\" 段落编项原文=\"\" 合同全文结构一级分段=\"6\" 段落框架结构=\"合同正文\" 段落内容=\"根据《中华人民共和国合同法》及有关法律法规规定，买卖双方在平等、自愿、公平的基础上，经充分协商，就花卉订购事宜订立本合同。\" 段落字数=\"61\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"6\" 段落编项=\"第1条\" 段落编项原文=\"一\" 合同全文结构一级分段=\"6\" 段落框架结构=\"条\" 段落内容=\"一、花卉交售品种、数量、价格\" 段落字数=\"14\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"7\" 段落编项=\"第1条第1款\" 段落编项原文=\"1\" 合同全文结构一级分段=\"6\" 段落框架结构=\"款\" 段落内容=\"1．卖方全年向买方交付各种花卉一千盆（枝、株），\" 段落字数=\"24\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"8\" 段落编项=\"第1条第1款\" 段落编项原文=\"\" 合同全文结构一级分段=\"6\" 段落框架结构=\"款\" 段落内容=\"分月分旬交售花卉的品种、数量、日期由双方另行约定。\" 段落字数=\"25\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"9\" 段落编项=\"第1条第2款\" 段落编项原文=\"2\" 合同全文结构一级分段=\"6\" 段落框架结构=\"款\" 段落内容=\"2．花卉收购价格：买方以不低于伍拾元的保护价进行收购，或由双方于收购前按花卉等级和收购时市场收购价协商确定，但不得低于保护价。\" 段落字数=\"63\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"10\" 段落编项=\"第1条第3款\" 段落编项原文=\"3\" 合同全文结构一级分段=\"6\" 段落框架结构=\"款\" 段落内容=\"3．花卉总价款为伍万元，由买方预付定金：壹万元；\" 段落字数=\"24\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"11\" 段落编项=\"第2条\" 段落编项原文=\"二\" 合同全文结构一级分段=\"6\" 段落框架结构=\"条\" 段落内容=\"二、质量要求\" 段落字数=\"6\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"12\" 段落编项=\"第2条第1款\" 段落编项原文=\"1\" 合同全文结构一级分段=\"6\" 段落框架结构=\"款\" 段落内容=\"1．花卉品种的规格：\" 段落字数=\"10\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"13\" 段落编项=\"第2条第2款\" 段落编项原文=\"2\" 合同全文结构一级分段=\"6\" 段落框架结构=\"款\" 段落内容=\"2．等级等质量要求：有国家标准的执行国家标准，未有国家标准的，按双方约定标准。\" 段落字数=\"39\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"14\" 段落编项=\"第3条\" 段落编项原文=\"三\" 合同全文结构一级分段=\"6\" 段落框架结构=\"条\" 段落内容=\"三、收购时间与方式\" 段落字数=\"9\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"15\" 段落编项=\"第3条第1款\" 段落编项原文=\"\" 合同全文结构一级分段=\"6\" 段落框架结构=\"款\" 段落内容=\"花卉交售时间由双方协商，买方须提前一天提出次日应交售的品种、数量，并以书面方式通知卖方。卖方交售与预约允许上下浮动10%。\" 段落字数=\"61\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"16\" 段落编项=\"第4条\" 段落编项原文=\"四\" 合同全文结构一级分段=\"6\" 段落框架结构=\"条\" 段落内容=\"四、包装要求与费用承担\" 段落字数=\"11\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"17\" 段落编项=\"第4条第1款\" 段落编项原文=\"\" 合同全文结构一级分段=\"6\" 段落框架结构=\"款\" 段落内容=\"买方提供包装标准及材料，负责包装费用，卖方按买方要求进行包装。\" 段落字数=\"31\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"18\" 段落编项=\"第5条\" 段落编项原文=\"五\" 合同全文结构一级分段=\"6\" 段落框架结构=\"条\" 段落内容=\"五、付款方式：\" 段落字数=\"7\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"19\" 段落编项=\"第5条第1款\" 段落编项原文=\"\" 合同全文结构一级分段=\"6\" 段落框架结构=\"款\" 段落内容=\"买方收货验收合格后，采用现金方式付款，最迟不得超过三天。\" 段落字数=\"28\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"20\" 段落编项=\"第6条\" 段落编项原文=\"六\" 合同全文结构一级分段=\"6\" 段落框架结构=\"条\" 段落内容=\"六、买方的权利和义务\" 段落字数=\"10\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"21\" 段落编项=\"第6条第1款\" 段落编项原文=\"1\" 合同全文结构一级分段=\"6\" 段落框架结构=\"款\" 段落内容=\"1．及时验收卖方交售的花卉，收货后即支付花卉款。\" 段落字数=\"24\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"22\" 段落编项=\"第6条第2款\" 段落编项原文=\"2\" 合同全文结构一级分段=\"6\" 段落框架结构=\"款\" 段落内容=\"2．确定花卉等级要按照国家规定的质量标准，不得任意压级压价。\" 段落字数=\"30\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"23\" 段落编项=\"第6条第3款\" 段落编项原文=\"3\" 合同全文结构一级分段=\"6\" 段落框架结构=\"款\" 段落内容=\"3．有权拒收卖方交售的不符合国家行业质量标准的花卉，但必须向对方说明理由。\" 段落字数=\"37\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"24\" 段落编项=\"第7条\" 段落编项原文=\"七\" 合同全文结构一级分段=\"6\" 段落框架结构=\"条\" 段落内容=\"七、卖方的权利和义务\" 段落字数=\"10\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"25\" 段落编项=\"第7条第1款\" 段落编项原文=\"1\" 合同全文结构一级分段=\"6\" 段落框架结构=\"款\" 段落内容=\"1．必须按照规定施用花肥花药，严禁对花卉使用违禁农药、化肥。\" 段落字数=\"30\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"26\" 段落编项=\"第7条第2款\" 段落编项原文=\"2\" 合同全文结构一级分段=\"6\" 段落框架结构=\"款\" 段落内容=\"2．保证按合同约定的品种和数量种植花卉。\" 段落字数=\"20\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"27\" 段落编项=\"第7条第3款\" 段落编项原文=\"3\" 合同全文结构一级分段=\"6\" 段落框架结构=\"款\" 段落内容=\"3．花卉种植如受气候条件的影响，允许在减产10%的幅度内不以违约论。\" 段落字数=\"34\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"28\" 段落编项=\"第8条\" 段落编项原文=\"八\" 合同全文结构一级分段=\"6\" 段落框架结构=\"条\" 段落内容=\"八、买方违约责任\" 段落字数=\"8\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"29\" 段落编项=\"第8条第1款\" 段落编项原文=\"1\" 合同全文结构一级分段=\"6\" 段落框架结构=\"款\" 段落内容=\"1．没有按合同约定收购，造成花卉腐烂等损失，或故意压级压价，除赔偿卖方的损失外，应向卖方支付该批花卉总价值40%的违约金。\" 段落字数=\"61\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"30\" 段落编项=\"第8条第2款\" 段落编项原文=\"2\" 合同全文结构一级分段=\"6\" 段落框架结构=\"款\" 段落内容=\"2．拖延支付花卉款，应参照银行关于拖延付款的规定，向卖方偿付违约金。\" 段落字数=\"34\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"31\" 段落编项=\"第9条\" 段落编项原文=\"九\" 合同全文结构一级分段=\"6\" 段落框架结构=\"条\" 段落内容=\"九、卖方违约责任\" 段落字数=\"8\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"32\" 段落编项=\"第9条第1款\" 段落编项原文=\"1\" 合同全文结构一级分段=\"6\" 段落框架结构=\"款\" 段落内容=\"1．非因不可抗力，未完成当月合同总数量的90%，应向买方支付未完成部分花卉总价值40%的违约金。\" 段落字数=\"48\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"33\" 段落编项=\"第9条第2款\" 段落编项原文=\"2\" 合同全文结构一级分段=\"6\" 段落框架结构=\"款\" 段落内容=\"2．交售使用违禁农药、化肥的花卉，应按该批货值40%向买方支付违约金。因此造成人身伤亡，卖方应承担一切责任。\" 段落字数=\"54\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"34\" 段落编项=\"第10条\" 段落编项原文=\"十\" 合同全文结构一级分段=\"6\" 段落框架结构=\"条\" 段落内容=\"十、不可抗力\" 段落字数=\"6\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"35\" 段落编项=\"第10条第1款\" 段落编项原文=\"\" 合同全文结构一级分段=\"6\" 段落框架结构=\"款\" 段落内容=\"如因不可抗力造成卖方不能按合同约定交售花卉，买方应据实减少卖方所承担的交售数量，卖方可不承担违约责任。\" 段落字数=\"51\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"36\" 段落编项=\"第11条\" 段落编项原文=\"十一\" 合同全文结构一级分段=\"6\" 段落框架结构=\"条\" 段落内容=\"十一、争议解决方式\" 段落字数=\"9\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"37\" 段落编项=\"第11条第1款\" 段落编项原文=\"\" 合同全文结构一级分段=\"6\" 段落框架结构=\"款\" 段落内容=\"本合同在履行过程中发生争议的，由双方协商解决，如协商不成，可以依法向三明市沙县区人民法院起诉。\" 段落字数=\"47\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"38\" 段落编项=\"第12条\" 段落编项原文=\"十二\" 合同全文结构一级分段=\"6\" 段落框架结构=\"条\" 段落内容=\"十二、合同期限\" 段落字数=\"7\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"39\" 段落编项=\"第12条第1款\" 段落编项原文=\"\" 合同全文结构一级分段=\"6\" 段落框架结构=\"款\" 段落内容=\"本合同有效期一年，自2021年2月10日至2022年2月10日止。\" 段落字数=\"33\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"40\" 段落编项=\"第13条\" 段落编项原文=\"十三\" 合同全文结构一级分段=\"6\" 段落框架结构=\"条\" 段落内容=\"十三、本合同自双方签字盖章之日起生效。本合同未尽事宜，按照《合同法》等国家有关规定，经合同双方协商，作出补充协议，补充协议与本合同具有同等法律效力。\" 段落字数=\"74\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"41\" 段落编项=\"第13条第1款\" 段落编项原文=\"\" 合同全文结构一级分段=\"6\" 段落框架结构=\"款\" 段落内容=\"本合同一式二份，合同双方各执一份。\" 段落字数=\"17\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"42\" 段落编项=\"\" 段落编项原文=\"\" 合同全文结构一级分段=\"8\" 段落框架结构=\"合同尾部\" 段落内容=\"甲方：张某某（签章）\" 段落字数=\"10\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"43\" 段落编项=\"\" 段落编项原文=\"\" 合同全文结构一级分段=\"8\" 段落框架结构=\"合同尾部\" 段落内容=\"乙方：三明市花圃（签章）\" 段落字数=\"12\"/>\n" +
//                "\t<合同全文结构信息 段落编码=\"\" 段落顺序号=\"44\" 段落编项=\"\" 段落编项原文=\"\" 合同全文结构一级分段=\"8\" 段落框架结构=\"合同尾部\" 段落内容=\"签订日期：2021年2月9日\" 段落字数=\"14\"/>\n" +
//                "\t<合同条文信息 合同条文标识=\"\" 合同条文顺序号=\"1\" 合同条文编项=\"第1条\" 段落内容=\"一、花卉交售品种、数量、价格&#xA;1．卖方全年向买方交付各种花卉一千盆（枝、株），&#xA;分月分旬交售花卉的品种、数量、日期由双方另行约定。&#xA;2．花卉收购价格：买方以不低于伍拾元的保护价进行收购，或由双方于收购前按花卉等级和收购时市场收购价协商确定，但不得低于保护价。&#xA;3．花卉总价款为伍万元，由买方预付定金：壹万元；\" 合同条文一级分类=\"标的条款\" 合同条文二级分类=\"标的基本信息条款\"/>\n" +
//                "\t<合同条文信息 合同条文标识=\"\" 合同条文顺序号=\"2\" 合同条文编项=\"第2条\" 段落内容=\"二、质量要求&#xA;1．花卉品种的规格：&#xA;2．等级等质量要求：有国家标准的执行国家标准，未有国家标准的，按双方约定标准。\" 合同条文一级分类=\"标的条款\" 合同条文二级分类=\"标的质量条款\"/>\n" +
//                "\t<合同条文信息 合同条文标识=\"\" 合同条文顺序号=\"3\" 合同条文编项=\"第3条\" 段落内容=\"三、收购时间与方式&#xA;花卉交售时间由双方协商，买方须提前一天提出次日应交售的品种、数量，并以书面方式通知卖方。卖方交售与预约允许上下浮动10%。\" 合同条文一级分类=\"履行\" 合同条文二级分类=\"履行方式\">\n" +
//                "\t\t<合同要素信息 合同要素名称=\"履约时间通知方式\" 合同要素取值=\"书面\"/>\n" +
//                "\t</合同条文信息>\n" +
//                "\t<合同条文信息 合同条文标识=\"\" 合同条文顺序号=\"4\" 合同条文编项=\"第4条\" 段落内容=\"四、包装要求与费用承担&#xA;买方提供包装标准及材料，负责包装费用，卖方按买方要求进行包装。\" 合同条文一级分类=\"标的条款\" 合同条文二级分类=\"标的包装方式条款\">\n" +
//                "\t\t<合同要素信息 合同要素名称=\"包装费用承担方\" 合同要素取值=\"买方\"/>\n" +
//                "\t</合同条文信息>\n" +
//                "\t<合同条文信息 合同条文标识=\"\" 合同条文顺序号=\"5\" 合同条文编项=\"第5条\" 段落内容=\"五、付款方式：&#xA;买方收货验收合格后，采用现金方式付款，最迟不得超过三天。\" 合同条文一级分类=\"价款及结算方式条款\" 合同条文二级分类=\"结算方式条款\">\n" +
//                "\t\t<合同要素信息 合同要素名称=\"付款方式\" 合同要素取值=\"现金\"/>\n" +
//                "\t</合同条文信息>\n" +
//                "\t<合同条文信息 合同条文标识=\"\" 合同条文顺序号=\"6\" 合同条文编项=\"第6条\" 段落内容=\"六、买方的权利和义务&#xA;1．及时验收卖方交售的花卉，收货后即支付花卉款。&#xA;2．确定花卉等级要按照国家规定的质量标准，不得任意压级压价。&#xA;3．有权拒收卖方交售的不符合国家行业质量标准的花卉，但必须向对方说明理由。\" 合同条文一级分类=\"法律效力条款\" 合同条文二级分类=\"\"/>\n" +
//                "\t<合同条文信息 合同条文标识=\"\" 合同条文顺序号=\"7\" 合同条文编项=\"第7条\" 段落内容=\"七、卖方的权利和义务&#xA;1．必须按照规定施用花肥花药，严禁对花卉使用违禁农药、化肥。&#xA;2．保证按合同约定的品种和数量种植花卉。&#xA;3．花卉种植如受气候条件的影响，允许在减产10%的幅度内不以违约论。\" 合同条文一级分类=\"法律效力条款\" 合同条文二级分类=\"\"/>\n" +
//                "\t<合同条文信息 合同条文标识=\"\" 合同条文顺序号=\"8\" 合同条文编项=\"第8条\" 段落内容=\"八、买方违约责任&#xA;1．没有按合同约定收购，造成花卉腐烂等损失，或故意压级压价，除赔偿卖方的损失外，应向卖方支付该批花卉总价值40%的违约金。&#xA;2．拖延支付花卉款，应参照银行关于拖延付款的规定，向卖方偿付违约金。\" 合同条文一级分类=\"违约责任条款\" 合同条文二级分类=\"违约金条款\"/>\n" +
//                "\t<合同条文信息 合同条文标识=\"\" 合同条文顺序号=\"9\" 合同条文编项=\"第9条\" 段落内容=\"九、卖方违约责任&#xA;1．非因不可抗力，未完成当月合同总数量的90%，应向买方支付未完成部分花卉总价值40%的违约金。&#xA;2．交售使用违禁农药、化肥的花卉，应按该批货值40%向买方支付违约金。因此造成人身伤亡，卖方应承担一切责任。\" 合同条文一级分类=\"违约责任条款\" 合同条文二级分类=\"违约金条款\"/>\n" +
//                "\t<合同条文信息 合同条文标识=\"\" 合同条文顺序号=\"10\" 合同条文编项=\"第10条\" 段落内容=\"十、不可抗力&#xA;如因不可抗力造成卖方不能按合同约定交售花卉，买方应据实减少卖方所承担的交售数量，卖方可不承担违约责任。\" 合同条文一级分类=\"不可抗力条款\" 合同条文二级分类=\"\"/>\n" +
//                "\t<合同条文信息 合同条文标识=\"\" 合同条文顺序号=\"11\" 合同条文编项=\"第11条\" 段落内容=\"十一、争议解决方式&#xA;本合同在履行过程中发生争议的，由双方协商解决，如协商不成，可以依法向三明市沙县区人民法院起诉。\" 合同条文一级分类=\"争议解决条款\" 合同条文二级分类=\"\">\n" +
//                "\t\t<合同要素信息 合同要素名称=\"争议解决方式\" 合同要素取值=\"协商或起诉\"/>\n" +
//                "\t</合同条文信息>\n" +
//                "\t<合同条文信息 合同条文标识=\"\" 合同条文顺序号=\"12\" 合同条文编项=\"第12条\" 段落内容=\"十二、合同期限&#xA;本合同有效期一年，自2021年2月10日至2022年2月10日止。\" 合同条文一级分类=\"生效和有效期条款\" 合同条文二级分类=\"\"/>\n" +
//                "\t<合同条文信息 合同条文标识=\"\" 合同条文顺序号=\"13\" 合同条文编项=\"第13条\" 段落内容=\"十三、本合同自双方签字盖章之日起生效。本合同未尽事宜，按照《合同法》等国家有关规定，经合同双方协商，作出补充协议，补充协议与本合同具有同等法律效力。&#xA;本合同一式二份，合同双方各执一份。\" 合同条文一级分类=\"合同签约份数条款\" 合同条文二级分类=\"\"/>\n" +
//                "\t<引用法律法规信息 引用法律法规名称=\"中华人民共和国合同法\" 引用条款编项=\"第六十二条第一项\" 引用条=\"第六十二条\" 引用法条内容=\"当事人就有关合同内容约定不明确，依照本法第六十一条的规定仍不能确定的，适用下列规定：&#xA;（一）质量要求不明确的，按照国家标准、行业标准履行；没有国家标准、行业标准的，按照通常标准或者符合合同目的的特定标准履行。\" 引用款=\"\" 引用项=\"第一项\" 引用目=\"\"/>\n" +
//                "\t<引用法律法规信息 引用法律法规名称=\"中华人民共和国合同法\" 引用条款编项=\"第一百二十八条\" 引用条=\"第一百二十八条\" 引用法条内容=\"当事人可以通过和解或者调解解决合同争议。当事人不愿和解、调解或者和解、调解不成的，可以根据仲裁协议向仲裁机构申请仲裁。涉外合同的当事人可以根据仲裁协议向中国仲裁机构或者其他仲裁机构申请仲裁。当事人没有订立仲裁协议或者仲裁协议无效的，可以向人民法院起诉。当事人应当履行发生法律效力的判决、仲裁裁决、调解书；拒不履行的，对方可以请求人民法院执行。\" 引用款=\"\" 引用项=\"\" 引用目=\"\"/>\n" +
//                "\t<履约信息 履约主体姓名或名称=\"三明市花圃\" 履约内容原文=\"卖方全年向买方交付各种花卉一千盆（枝、株），&#xA;分月分旬交售花卉的品种、数量、日期由双方另行约定。\" 履约内容类型=\"2\" 履约金额原文=\"\" 履约金额=\"\" 履约金额币种=\"\" 履约时间原文=\"全年\" 履约时间日期=\"\" 履约时间期限=\"360\"/>\n" +
//                "\t<履约信息 履约主体姓名或名称=\"张某某\" 履约内容原文=\"花卉总价款为伍万元，由买方预付定金：壹万元；\" 履约内容类型=\"1\" 履约金额原文=\"壹万元\" 履约金额=\"10000\" 履约金额币种=\"人民币\" 履约时间原文=\"\" 履约时间日期=\"\" 履约时间期限=\"\"/>\n" +
//                "\t<履约信息 履约主体姓名或名称=\"张某某\" 履约内容原文=\"买方收货验收合格后，采用现金方式付款，最迟不得超过三天。\" 履约内容类型=\"1\" 履约金额原文=\"\" 履约金额=\"\" 履约金额币种=\"\" 履约时间原文=\"最迟不得超过三天\" 履约时间日期=\"\" 履约时间期限=\"3\"/>\n" +
//                "\t<履约信息 履约主体姓名或名称=\"张某某\" 履约内容原文=\"花卉交售时间由双方协商，买方须提前一天提出次日应交售的品种、数量，并以书面方式通知卖方。\" 履约内容类型=\"5\" 履约金额原文=\"\" 履约金额=\"\" 履约金额币种=\"\" 履约时间原文=\"提前一天\" 履约时间日期=\"\" 履约时间期限=\"1\"/>\n" +
//                "\t<履约信息 履约主体姓名或名称=\"三明市花圃\" 履约内容原文=\"卖方按买方要求进行包装。\" 履约内容类型=\"5\" 履约金额原文=\"\" 履约金额=\"\" 履约金额币种=\"\" 履约时间原文=\"\" 履约时间日期=\"\" 履约时间期限=\"\"/>\n" +
//                "</合同基本信息>\n";
        //创建返回list
        List<JsonFormRespVO> resultList = new ArrayList<>();

        try {
            DocumentBuilderFactory factory = DocumentBuilderFactory.newInstance();
            DocumentBuilder builder = factory.newDocumentBuilder();
            Document document = builder.parse(new InputSource(new StringReader(xmlData)));

            // 创建JSON对象
            ObjectMapper mapper = new ObjectMapper();

            //动态表单
            if (CollectionUtil.isNotEmpty(formToJsonReqVO.getFormIdList())) {
                //获取动态表单绑定的对应参数
                for (String formId : formToJsonReqVO.getFormIdList()) {
                    FormDO formDO = formDOMapper.selectById(formId);
                    if (ObjectUtil.isNotEmpty(formDO)) {
                        //封装该表单所有表项value
                        List<JsonRespVO> valueList = new ArrayList<>();
                        List<FormItemDO> formItemDOList = formItemMapper.selectList(new LambdaQueryWrapper<FormItemDO>().in(FormItemDO::getFormId, formId));
                        //提取合同基本信息
                        NodeList nodeList1 = document.getElementsByTagName("合同基本信息");
                        for (int i = 0; i < nodeList1.getLength(); i++) {
                            Element element = (Element) nodeList1.item(i);
                            for (FormItemDO formItemDO : formItemDOList) {
                                String value = element.getAttribute(formItemDO.getName());
                                if (StringUtils.isNotEmpty(value)) {
                                    valueList.add(new JsonRespVO().setName(formItemDO.getName()).setCode(formItemDO.getCode()).setValue(value));
                                }
                            }
                        }
                        NodeList nodeList2 = document.getElementsByTagName("合同当事人");
                        for (int i = 0; i < nodeList2.getLength(); i++) {
                            Element element = (Element) nodeList2.item(i);
                            for (FormItemDO formItemDO : formItemDOList) {
                                String value = element.getAttribute(formItemDO.getName());
                                if (StringUtils.isNotEmpty(value)) {
                                    valueList.add(new JsonRespVO().setName(formItemDO.getName()).setCode(formItemDO.getCode()).setValue(value));
                                }
                            }
                        }
                        NodeList nodeList3 = document.getElementsByTagName("履约信息");
                        for (int i = 0; i < nodeList3.getLength(); i++) {
                            Element element = (Element) nodeList3.item(i);
                            for (FormItemDO formItemDO : formItemDOList) {
                                String value = element.getAttribute(formItemDO.getName());
                                if (StringUtils.isNotEmpty(value)) {
                                    valueList.add(new JsonRespVO().setName(formItemDO.getName()).setCode(formItemDO.getCode()).setValue(value));
                                }
                            }
                        }
                        //封装表单返回值
                        resultList.add(new JsonFormRespVO().setName(formDO.getName()).setCode(formDO.getCode()).setValueList(valueList));
                    }
                }
                return resultList;
            }
            //固定表单
            if (CollectionUtil.isEmpty(formToJsonReqVO.getFormIdList())) {
                //封装该表单所有表项value
                List<JsonRespVO> valueList1 = new ArrayList<>();
                //提取合同基本信息
                NodeList nodeList1 = document.getElementsByTagName("合同基本信息");
                for (int i = 0; i < nodeList1.getLength(); i++) {
                    Element element = (Element) nodeList1.item(i);
                    String name = element.getAttribute("合同名称");
                    String code = element.getAttribute("合同编号");
                    String contractSignTime = element.getAttribute("合同签署日期");
                    String contractSignAddress = element.getAttribute("当事方合同签署地址");

                    valueList1.add(new JsonRespVO().setName("合同名称").setCode("name").setValue(name));
                    valueList1.add(new JsonRespVO().setName("合同编号").setCode("code").setValue(code));
                    valueList1.add(new JsonRespVO().setName("签约日期").setCode("contractSignTime").setValue(contractSignTime));
                    valueList1.add(new JsonRespVO().setName("签订地址").setCode("contractSignAddress").setValue(contractSignAddress));

                }
                resultList.add(new JsonFormRespVO().setName("合同基本信息").setCode("contractBaseInfo").setValueList(valueList1));

                List<JsonRespVO> valueList2 = new ArrayList<>();
                NodeList nodeList2 = document.getElementsByTagName("合同当事人");
                for (int j = 0; j < nodeList2.getLength(); j++) {
                    Element partyElement = (Element) nodeList2.item(j);
                    String partyName = partyElement.getAttribute("当事人姓名或名称");
                    String idType = partyElement.getAttribute("自然人证照类型");
                    String idNumber = partyElement.getAttribute("自然人证照号码");
                    String creditCode = partyElement.getAttribute("统一社会信用代码");
                    String partyType = partyElement.getAttribute("当事人类别");
                    String belongType = partyElement.getAttribute("所属方类型");
                    String partyIdentity = partyElement.getAttribute("当事人身份");
                    String legalRepresentative = partyElement.getAttribute("法定代表人或负责人");
                    String agentType = partyElement.getAttribute("代理人类型");
                    String agentName = partyElement.getAttribute("代理人姓名");
                    String agentIdentity = partyElement.getAttribute("代理人身份或职务");
                    String partyAbbreviation = partyElement.getAttribute("当事人简称");
                    String contactAddress = partyElement.getAttribute("联系地址");
                    String contactInformation = partyElement.getAttribute("联系方式");
                    String contactPerson = partyElement.getAttribute("联系人");
                    String partyContractSignDate = partyElement.getAttribute("当事方合同签署日期");
                    String partyContractSignAddress = partyElement.getAttribute("当事方合同签署地址");

                    valueList2.add(new JsonRespVO().setName("当事人姓名或名称").setCode("partyName").setValue(partyName));
                    valueList2.add(new JsonRespVO().setName("自然人证照类型").setCode("idType").setValue(idType));
                    valueList2.add(new JsonRespVO().setName("自然人证照号码").setCode("idNumber").setValue(idNumber));
                    valueList2.add(new JsonRespVO().setName("统一社会信用代码").setCode("creditCode").setValue(creditCode));
                    valueList2.add(new JsonRespVO().setName("当事人类别").setCode("partyType").setValue(partyType));
                    valueList2.add(new JsonRespVO().setName("所属方类型").setCode("belongType").setValue(belongType));
                    valueList2.add(new JsonRespVO().setName("当事人身份").setCode("partyIdentity").setValue(partyIdentity));
                    valueList2.add(new JsonRespVO().setName("法定代表人或负责人").setCode("legalRepresentative").setValue(legalRepresentative));
                    valueList2.add(new JsonRespVO().setName("代理人类型").setCode("agentType").setValue(agentType));
                    valueList2.add(new JsonRespVO().setName("代理人姓名").setCode("agentName").setValue(agentName));
                    valueList2.add(new JsonRespVO().setName("代理人身份或职务").setCode("agentIdentity").setValue(agentIdentity));
                    valueList2.add(new JsonRespVO().setName("当事人简称").setCode("partyAbbreviation").setValue(partyAbbreviation));
                    valueList2.add(new JsonRespVO().setName("联系地址").setCode("contactAddress").setValue(contactAddress));
                    valueList2.add(new JsonRespVO().setName("联系方式").setCode("contactInformation").setValue(contactInformation));
                    valueList2.add(new JsonRespVO().setName("联系人").setCode("contactPerson").setValue(contactPerson));
                    valueList2.add(new JsonRespVO().setName("当事方合同签署日期").setCode("partyContractSignDate").setValue(partyContractSignDate));
                    valueList2.add(new JsonRespVO().setName("当事方合同签署地址").setCode("partyContractSignAddress").setValue(partyContractSignAddress));
                }
                resultList.add(new JsonFormRespVO().setName("签订各方信息").setCode("contractParty").setValueList(valueList2));

                List<JsonRespVO> valueList3 = new ArrayList<>();
                NodeList nodeList3 = document.getElementsByTagName("履约信息");

                int performStartDateFlag = 0;
                int daysToAdd = 0;
                String performStartDate = "";
                Long totalMoney = 0L;
                for (int i = 0; i < nodeList3.getLength(); i++) {
                    Element element = (Element) nodeList3.item(i);
                    performStartDate = element.getAttribute("履约时间日期");
                    String days = element.getAttribute("履约时间期限");
                    String money = element.getAttribute("履约金额");

                    if (StringUtils.isNotEmpty(performStartDate)) {
                        performStartDateFlag++;
                    }
                    if (performStartDateFlag == 1) {
                        valueList3.add(new JsonRespVO().setName("履约开始日期").setCode("performStartDate").setValue(performStartDate));
                        performStartDateFlag++;
                    }
                    if (StringUtils.isNotEmpty(days)) {
                        daysToAdd = daysToAdd + Integer.parseInt(days);
                    }
                    if (StringUtils.isNotEmpty(money)) {
                        totalMoney = totalMoney + Long.parseLong(money);
                    }
                }
                if (daysToAdd > 0 && performStartDateFlag > 0) {
                    // 将performEndDate字符串转换为日期类型
                    SimpleDateFormat sdf = new SimpleDateFormat("yyyy-MM-dd");
                    Date endDate = sdf.parse(performStartDate);
                    // 使用Calendar类进行日期的加减操作
                    Calendar calendar = Calendar.getInstance();
                    calendar.setTime(endDate);
                    calendar.add(Calendar.DAY_OF_MONTH, daysToAdd);
                    // 获取加上天数后的日期
                    Date newDate = calendar.getTime();
                    // 将日期转换为字符串
                    String resultDate = sdf.format(newDate);
                    valueList3.add(new JsonRespVO().setName("履约结束日期").setCode("performEndDate").setValue(resultDate));
                }
                if (totalMoney > 0) {
                    valueList3.add(new JsonRespVO().setName("总金额").setCode("totalMoney").setValue(String.valueOf(totalMoney)));
                }
                resultList.add(new JsonFormRespVO().setName("履约信息").setCode("performInfo").setValueList(valueList3));
            }
        } catch (Exception e) {
            e.printStackTrace();
        }
        return resultList;
    }

    @Override
    public GetTokenRespVO getToken(String appId, String tokenId) throws UnsupportedEncodingException {
        GetTokenDTO token = legalismApi.getToken(appId, tokenId);
        GetTokenRespVO getTokenRespVO = ContractConverter.INSTANCE.toGetTokenRespVO(token);
        return getTokenRespVO;
    }

    @Override
    public ErrorInfosRespVO getErrorInfos(ErrorInfosReqVO vo) throws JsonProcessingException {
        JSONObject requestBody = (JSONObject) JSONObject.toJSON(vo);
        GetTokenDTO errorInfos = legalismApi.getErrorInfos(requestBody);
        ErrorInfosRespVO errorInfosRespVO = ContractConverter.INSTANCE.toErrorInfosRespVO(errorInfos);
        return errorInfosRespVO;
    }

    public static MultipartFile convert(byte[] fileBytes, String fileName, String contentType) {
        return new MockMultipartFile(fileName, fileName, contentType, fileBytes);
    }

    @Override
    public CorrectionRespVO correction(CorrectionReqVO reqVO) throws Exception {
        CorrectionRespVO result = new CorrectionRespVO();
        byte[] fileBytes = null;
        String fileName = null;
        Long fileId = null;
        if(ObjectUtil.isNotEmpty(reqVO.getFile())){
            fileBytes = Sm4Utils.decryptEcb4InspectionV2(reqVO.getFile().getBytes());
            MultipartFile file = convert(fileBytes, reqVO.getFile().getOriginalFilename(), reqVO.getFile().getContentType());
            Map<String, Object> stringObjectMap = fileApi.uploadFileV3(file.getOriginalFilename(), FileUploadPathEnum.CONTRACT_EXAMINATION, null, IoUtil.readBytes(file.getInputStream()));
            String url = (String) stringObjectMap.get("url");
            if(reqVO.getFileId()!=null){
                fileId = reqVO.getFileId();
                result.setFileId(reqVO.getFileId());
            }else{
                fileId = (Long) stringObjectMap.get("fileId");
                result.setFileId(fileId);
            }
            result.setFileUrl(url);
            fileBytes = IoUtil.readBytes(file.getInputStream());
            fileName = file.getOriginalFilename();
        }else if (StringUtils.isNotEmpty(reqVO.getLocalPath())){
            String path = reqVO.getLocalPath();
            File file = new File(path);
            //转换成MultipartFile
            MultipartFile convert = convert(file);
            MultipartFile multipartFile = Sm4Utils.convertFile2(convert);
            fileBytes = Sm4Utils.decryptEcb4InspectionV2(multipartFile.getBytes());
            fileName = file.getName();
            fileId = Long.valueOf(convertUrlToString(reqVO.getLocalPath()));
            result.setFileId(fileId);
        }else if(ObjectUtil.isNotEmpty(reqVO.getFileId())){
            FileDTO fileDTO = fileApi.selectById(reqVO.getFileId());
            if(fileDTO!=null){
                fileId = fileDTO.getId();
                fileName = fileDTO.getName();
                result.setFileId(fileId);
                result.setFileUrl(fileDTO.getUrl());
                fileBytes = readFileFromRemoteUrl(fileDTO.getUrl());
            }
        }else if(ObjectUtil.isNotEmpty(reqVO.getPath())){
            fileBytes = readFileFromRemoteUrl(reqVO.getPath());
            if(reqVO.getFileId()!=null){
                fileId = reqVO.getFileId();
            }else{
                fileId = Long.valueOf(convertUrlToString(reqVO.getPath()));
            }
            fileName =reqVO.getPath().substring(reqVO.getPath().lastIndexOf('/') + 1);
            result.setFileId(fileId);
            result.setFileUrl(reqVO.getPath());
        }
        try {
            // 创建 Web 服务客户端代理工厂
            JaxWsProxyFactoryBean factory = new JaxWsProxyFactoryBean();
            factory.setServiceClass(LawyeeService.class);

            // 设置 Web 服务地址
            factory.setAddress("http://1.119.162.45:8370/cxf/services/lawyeeservice");

            // 创建 Web 服务客户端代理
            LawyeeService client = (LawyeeService) factory.create();
            String otherParaInfo="{}";
            if (StringUtils.equals(SUFFIX_PDF, FileNameUtil.extName(fileName).toLowerCase())) {
                otherParaInfo="{\"fileType\":\"pdf\"}";
            }
            if (StringUtils.equals(SUFFIX_DOCX, FileNameUtil.extName(fileName).toLowerCase())) {
                otherParaInfo="{\"fileType\":\"docx\"}";
            }
            String token = "<Users>\n" + "\t<item>\n" + "\t\t<OrgID>0</OrgID>\n" + "\t\t<OrgName>最高人民法院</OrgName>\n" + "\t\t<DptName>业务部门</DptName>\n" + "\t\t<UserName>910009</UserName>\n" + "\t\t<UserID>1</UserID>\n" + "\t\t<PostID></PostID>\n" + "\t\t<DptID>1</DptID>\n" + "\t\t<PostName>专员</PostName>\n" + "\t</item>\n" + "</Users>";
            // 调用 Web 服务的方法
         String  correctionUrl = client.checkFileCallBackHY(fileId.toString(), fileBytes, "webservicecallback1", "http://1.119.162.45:8370/cxf/services/lawyeeservice?wsdl", "LawyeeServiceService", otherParaInfo, token);
            // 处理结果
            System.out.println("token------------------: " + token);
            System.out.println("Result from WebService------------------: " + correctionUrl);
            result.setCorrectionUrl(correctionUrl);
        } catch (Exception e) {
            e.printStackTrace();
        }

        return result;
    }

    private static byte[] readFileFromRemoteUrl(String remoteUrl) throws IOException {
        URL url = new URL(remoteUrl);
        HttpURLConnection connection = (HttpURLConnection) url.openConnection();
        connection.setRequestMethod("GET");
        try (InputStream inputStream = connection.getInputStream()) {
            ByteArrayOutputStream output = new ByteArrayOutputStream();
            byte[] buffer = new byte[4096];
            int bytesRead;
            while ((bytesRead = inputStream.read(buffer)) != -1) {
                output.write(buffer, 0, bytesRead);
            }
            return output.toByteArray();
        } finally {
            connection.disconnect();
        }
    }

    @Override
    public TokenRespVO generateToken() {
        String appId = "1800546095495811074";
        String secret = "MFkwEwYHKoZIzj0CAQYIKoEcz1UBgi0DQgAEmRqh0C1t5Mb9rwDMeD2jVdllpiEBdop0etb5+69DFmHzEHQSE0HVEzoTt4JTvU7N9GN2pw30dQLv8TY3+pKJKA==";
        String sign = getSign(appId, secret);
        //获取token
        SppGPTGetTokenDTO sppGPTGetTokenDTO = new SppGPTGetTokenDTO().setAppId(appId).setSign(sign);
        SppGPTResponseDTO stringSppGPTResponseDTO = sppGPTApi.generateToken(sppGPTGetTokenDTO);
        Object data = stringSppGPTResponseDTO.getData();
        JsonNode jsonNode = JsonUtils.parseTree(JsonUtils.toJsonString(data));
        TokenRespVO token = new TokenRespVO().setToken(jsonNode.get("token").asText());
        return token;
    }

    public static String getSign(String appId, String secret) {
        SM2 sm2 = new SM2(null, secret);

        // 请求参数
        Map params = new TreeMap();
        params.put("appId", appId);
        params.put("timestamp", new Date().getTime());

        // 将TreeMap转换为Url参数形式
        String query = HttpUtil.toParams(params);
        System.out.println("排序参数：" + query);

        // 生成sign
        String sign = Base64.getEncoder().encodeToString(sm2.encrypt(StrUtil.bytes(query, CharsetUtil.CHARSET_UTF_8), KeyType.PublicKey));
        System.out.println("生成签名：" + sign);
        return sign;
    }

    @Override
    public TaskIdRespVO upload(MultipartFile file) throws Exception {
        String token = "Bearer " + generateToken().getToken();
        SppGPTResponseDTO upload = sppGPTApi.uploadFile(token, "contract", file);
        Object data = upload.getData();
        JsonNode jsonNode = JsonUtils.parseTree(JsonUtils.toJsonString(data));
        TaskIdRespVO taskId = new TaskIdRespVO().setTaskId(jsonNode.get("taskId").asText());
        return taskId;
    }

    @Override
    @Transactional(rollbackFor = Exception.class)
    public ContractDetailRespVO detail(String taskIds) {
        String token = "Bearer " + generateToken().getToken();
        SppGPTDetailDTO sppGPTDetailDTO = new SppGPTDetailDTO().setTaskIds(taskIds);
        SppGPTResponseDTO sppGPTResponseDTO = sppGPTApi.contractDetail(token, sppGPTDetailDTO);
        HashMap map = sppGPTResponseDTO.getData();
        String jsonString = JsonUtils.toJsonString(map);
        ContractDetailRespVO contractDetailRespVO = JsonUtils.parseObject(jsonString, ContractDetailRespVO.class);
        List<Contract> contracts = null;
        if (contractDetailRespVO != null) {
            contracts = contractDetailRespVO.getContracts();
        }
        String[] split = taskIds.split(",");
        List<String> ids = Arrays.asList(split);
        List<ContractDetailsDO> contractDetailsDOS = contractDetailsMapper.selectBatchIds(ids);
        //如果为空，则全部新增
        if (ObjectUtil.isEmpty(contractDetailsDOS)) {
            List<ContractDetailsDO> contractDetailsList = new ArrayList<>();
            if (contracts != null) {
                for (Contract contract : contracts) {
                    ContractDetailsDO contractDetailsDO = getContractDetailsDO(contract);
                    contractDetailsList.add(contractDetailsDO);
                }
            }
            if (!contractDetailsList.isEmpty()) {
                contractDetailsMapper.insertBatch(contractDetailsList);
            }
        } else {
            //如果不为空，需判断是哪条数据不为空，哪条数据为空，不为空的数据进行修改，为空的数据进行添加
            // 存在的 taskId 集合
            Set<String> taskIdList = contractDetailsDOS.stream().map(ContractDetailsDO::getId).collect(Collectors.toSet());
            // 要更新的列表
            List<ContractDetailsDO> updateList = new ArrayList<>();
            // 要新增的列表
            List<ContractDetailsDO> insertList = new ArrayList<>();
            if (contracts != null) {
                for (Contract contract : contracts) {
                    ContractDetailsDO contractDetailsDO = getContractDetailsDO(contract);
                    if (taskIdList.contains(contract.getTaskId())) {
                        // 更新
                        updateList.add(contractDetailsDO);
                    } else {
                        // 新增
                        insertList.add(contractDetailsDO);
                    }
                }
            }
            // 执行更新操作
            if (!updateList.isEmpty()) {
                for (ContractDetailsDO update : updateList) {
                    contractDetailsMapper.updateById(update);
                }
            }
            // 执行新增操作
            if (!insertList.isEmpty()) {
                contractDetailsMapper.insertBatch(insertList);
            }

        }
        return contractDetailRespVO;
    }

    private ContractDetailsDO getContractDetailsDO(Contract contract) {
        return new ContractDetailsDO().setId(contract.getTaskId()).setStatus(contract.getStatus()).setContractBaseInfo(JsonUtils.toJsonString(contract.getContractBaseInfo())).setPurchaseDetail(JsonUtils.toJsonString(contract.getPurchaseDetail())).setSuppliers(JsonUtils.toJsonString(contract.getSuppliers())).setSubSuppliers(JsonUtils.toJsonString(contract.getSubSuppliers())).setPaymentPlan(JsonUtils.toJsonString(contract.getPaymentPlan())).setAcceptRequirement(JsonUtils.toJsonString(contract.getAcceptRequirement())).setProjectManager(JsonUtils.toJsonString(contract.getProjectManager()));
    }

    @Override
    public ContractDetailRespVO getDetail(String taskId) {
        ContractDetailsDO contractDetailsDO = contractDetailsMapper.selectOne("task_id", taskId);
        if (ObjectUtil.isNotEmpty(contractDetailsDO)) {
            ContractBaseInfo contractBaseInfo = JsonUtils.parseObject(contractDetailsDO.getContractBaseInfo(), ContractBaseInfo.class);
            List<PurchaseDetail> purchaseDetail = JsonUtils.parseArray(contractDetailsDO.getPurchaseDetail(), PurchaseDetail.class);
            List<Suppliers> suppliers = JsonUtils.parseArray(contractDetailsDO.getSuppliers(), Suppliers.class);
            List<SubSuppliers> subSuppliers = JsonUtils.parseArray(contractDetailsDO.getSubSuppliers(), SubSuppliers.class);
            List<PaymentPlan> paymentPlan = JsonUtils.parseArray(contractDetailsDO.getPaymentPlan(), PaymentPlan.class);
            AcceptRequirement acceptRequirement = JsonUtils.parseObject(contractDetailsDO.getAcceptRequirement(), AcceptRequirement.class);
            ProjectManager projectManager = JsonUtils.parseObject(contractDetailsDO.getProjectManager(), ProjectManager.class);
            Contract contract = new Contract().setTaskId(contractDetailsDO.getId()).setStatus(contractDetailsDO.getStatus()).setContractBaseInfo(contractBaseInfo).setPurchaseDetail(purchaseDetail).setSuppliers(suppliers).setSubSuppliers(subSuppliers).setPaymentPlan(paymentPlan).setAcceptRequirement(acceptRequirement).setProjectManager(projectManager);
            return new ContractDetailRespVO().setContracts(Collections.singletonList(contract));
        }
        return null;
    }

    @Override
    public  Map<String, String> jsonV2(ToJsonReqVO toJsonReqVO) throws IOException {
        //1.法益webservice提取信息
        Long fileId = toJsonReqVO.getFileId();
//        String path = fileApi.getURL(fileId);
        File file = new File(toJsonReqVO.getFilePath());
        byte[] fileBytes = readFileToByteArray(toJsonReqVO.getFilePath());
        String fileName = file.getName();
        String result = "";
        try {
            // 创建 Web 服务客户端代理工厂
            JaxWsProxyFactoryBean factory = new JaxWsProxyFactoryBean();
            factory.setServiceClass(LawyeeService.class);

            // 设置 Web 服务地址
            factory.setAddress("http://1.119.162.45:8370/cxf/services/lawyeeservice");
            String otherParaInfo="{}";
            if (StringUtils.equals(SUFFIX_PDF, FileNameUtil.extName(fileName).toLowerCase())) {
                otherParaInfo="{\"fileType\":\"pdf\"}";
            }
            if (StringUtils.equals(SUFFIX_DOCX, FileNameUtil.extName(fileName).toLowerCase())) {
                otherParaInfo="{\"fileType\":\"docx\"}";
            }
            // 创建 Web 服务客户端代理
            LawyeeService client = (LawyeeService) factory.create();
//            byte[] fileBytes = readFileToByteArray(path);
            String token = "<Users>\n" + "\t<item>\n" + "\t\t<OrgID>0</OrgID>\n" + "\t\t<OrgName>最高人民法院</OrgName>\n" + "\t\t<DptName>业务部门</DptName>\n" + "\t\t<UserName>910009</UserName>\n" + "\t\t<UserID>1</UserID>\n" + "\t\t<PostID></PostID>\n" + "\t\t<DptID>1</DptID>\n" + "\t\t<PostName>专员</PostName>\n" + "\t</item>\n" + "</Users>";
            // 调用 Web 服务的方法
            result = client.getXMLByText(fileBytes, token, "bs", fileId.toString(), otherParaInfo);

            // 处理结果
            System.out.println("token------------------: " + token);
            System.out.println("Result from WebService------------------: " + result);
        } catch (Exception e) {
            e.printStackTrace();
        }

        //2.封装数据转换
        String xmlData = result;
        // 将JSON字符串解析为JsonObject
        JsonObject jsonObject = JsonParser.parseString(xmlData).getAsJsonObject();
        // 获取"xml"对应的值
        if (jsonObject.has("xml") && !jsonObject.get("xml").isJsonNull()) {
            xmlData = jsonObject.get("xml").getAsString();
        }
        Map<String, String> xmlFields = new HashMap<>();
        try {
            // 1. 解析XML字符串
            DocumentBuilderFactory factory = DocumentBuilderFactory.newInstance();
            DocumentBuilder builder = factory.newDocumentBuilder();
            ByteArrayInputStream input = new ByteArrayInputStream(xmlData.getBytes("UTF-8"));
            Document document = builder.parse(input);

            // 2. 获取根元素
            Element root = document.getDocumentElement();

            // 3. 提取字段和值

            extractFields(root, xmlFields);

            // 输出结果
            xmlFields.forEach((key, value) -> System.out.println(key + " : " + value));
            return xmlFields;
        } catch (Exception e) {
            e.printStackTrace();
        }
        return xmlFields;
    }

    @Override
    public Map<String, Object> saveFile(String caseID, byte[] documentData, String sign) throws IOException {
        String path =  FileUploadPathEnum.CONTRACT_EXAMINATION.getPath() + FileUtils.generatePath(documentData, caseID);
        Map<String, Object> stringObjectMap = fileApi.uploadFileV3(caseID, FileUploadPathEnum.CONTRACT_EXAMINATION, path, documentData);

        return stringObjectMap;
    }



    // 递归提取节点及其属性和值
    private static void extractFields(Node node, Map<String, String> fields) {
        // 提取节点的属性
        if (node.hasAttributes()) {
            NamedNodeMap attributes = node.getAttributes();
            for (int i = 0; i < attributes.getLength(); i++) {
                Node attr = attributes.item(i);
                fields.put(attr.getNodeName(), attr.getNodeValue());
            }
        }

        // 如果节点有子节点，继续递归
        NodeList childNodes = node.getChildNodes();
        for (int i = 0; i < childNodes.getLength(); i++) {
            Node child = childNodes.item(i);
            if (child.getNodeType() == Node.ELEMENT_NODE) {
                extractFields(child, fields);
            }
        }
    }
    public static void main(String[] args) throws Exception {
        String url = "http://120.53.0.50:9000/ecms-econtract/contract/examination/955c727c4fb1eb6f3b442d8bb0d9b97b604566c9808ce84252e9f044126dd7b9.pdf";
        String number = convertUrlToString(url);
        System.out.println("10-digit number: " + number);

    }
    public static MultipartFile convert(File file) throws IOException {
        FileInputStream input = new FileInputStream(file);
        return new MockMultipartFile(file.getName(), file.getName(), "text/plain", input);
    }
    /**
     * 将固定的 URL 转换为固定 10 位数字字符串
     *
     * @param url 输入 URL
     * @return 转换后的 10 位数字字符串
     */
    public static String convertUrlToString(String url) {
        try {
            // 选择哈希算法（如 MD5 或 SHA-256）
            MessageDigest md = MessageDigest.getInstance("MD5");
            // 计算 URL 的哈希值
            byte[] hashBytes = md.digest(url.getBytes());
            // 将哈希值转为 16 进制字符串
            String hexHash = new BigInteger(1, hashBytes).toString(16);

            // 仅保留数字部分
            StringBuilder numericHash = new StringBuilder();
            for (char ch : hexHash.toCharArray()) {
                if (Character.isDigit(ch)) {
                    numericHash.append(ch);
                } else {
                    // 将字母转换为数字（A=1, B=2, ..., F=6）
                    numericHash.append((ch - 'a' + 1));
                }
            }

            // 截取 10 位数字
            if (numericHash.length() > 10) {
                return numericHash.substring(0, 10);
            } else {
                // 不足 10 位，补零
                while (numericHash.length() < 10) {
                    numericHash.append("0");
                }
                return numericHash.toString();
            }

        } catch (Exception e) {
            throw new RuntimeException("Error converting URL to 10 digits", e);
        }
    }
    @Override
    public CorrectionRespVO intelligentReview(CorrectionReqVO reqVO) throws Exception {
        CorrectionRespVO result = new CorrectionRespVO();
        byte[] fileBytes = null;
        String fileName = null;
        Long fileId = null;
        if(ObjectUtil.isNotEmpty(reqVO.getFile())&&!reqVO.getFile().isEmpty()){
            MultipartFile file = reqVO.getFile();
            Map<String, Object> stringObjectMap = fileApi.uploadFileV3(file.getOriginalFilename(), FileUploadPathEnum.CONTRACT_EXAMINATION, null, IoUtil.readBytes(file.getInputStream()));
            String url = (String) stringObjectMap.get("url");
            if(reqVO.getFileId()!=null){
                fileId = reqVO.getFileId();
                result.setFileId(reqVO.getFileId());
            }else{
                fileId = (Long) stringObjectMap.get("fileId");
                result.setFileId(fileId);
            }
            result.setFileUrl(url);
            fileBytes = IoUtil.readBytes(file.getInputStream());
            fileName = file.getOriginalFilename();
        }else if (StringUtils.isNotEmpty(reqVO.getLocalPath())){
            String path = reqVO.getLocalPath();
            File file = new File(path);
            fileBytes = readFileToByteArray(path);
            fileName = file.getName();
            fileId = Long.valueOf(convertUrlToString(path));
            result.setFileId(fileId);
        }else if(ObjectUtil.isNotEmpty(reqVO.getFileId())){
            FileDTO fileDTO = fileApi.selectById(reqVO.getFileId());
            if(fileDTO!=null){
                fileId = fileDTO.getId();
                fileName = fileDTO.getName();
                result.setFileId(fileId);
                result.setFileUrl(fileDTO.getUrl());
                fileBytes = readFileFromRemoteUrl(fileDTO.getUrl());
            }
        }else if(ObjectUtil.isNotEmpty(reqVO.getPath())){
            fileBytes = readFileFromRemoteUrl(reqVO.getPath());
            if(reqVO.getFileId()!=null){
                fileId = reqVO.getFileId();
            }else{
                fileId = Long.valueOf(convertUrlToString(reqVO.getPath()));
            }
            fileName =reqVO.getPath().substring(reqVO.getPath().lastIndexOf('/') + 1);
            result.setFileId(fileId);
            result.setFileUrl(reqVO.getPath());
        }
        try {
            // 创建 Web 服务客户端代理工厂
            JaxWsProxyFactoryBean factory = new JaxWsProxyFactoryBean();
            factory.setServiceClass(LawyeeService.class);

            // 设置 Web 服务地址
            factory.setAddress("http://1.119.162.45:8370/cxf/services/lawyeeservice");

            // 创建 Web 服务客户端代理
            LawyeeService client = (LawyeeService) factory.create();
            String otherParaInfo="{}";
            if (StringUtils.contains(fileName,"."+SUFFIX_PDF)) {
                otherParaInfo="{\"fileType\":\"pdf\"}";
            }
            if (StringUtils.contains(fileName,"."+SUFFIX_DOCX)) {
                otherParaInfo="{\"fileType\":\"docx\"}";
            }
            if (StringUtils.contains(fileName,"."+SUFFIX_OFD)) {
                otherParaInfo="{\"fileType\":\"ofd\"}";
            }
            String token = "<Users>\n" + "\t<item>\n" + "\t\t<OrgID>0</OrgID>\n" + "\t\t<OrgName>最高人民法院</OrgName>\n" + "\t\t<DptName>业务部门</DptName>\n" + "\t\t<UserName>910009</UserName>\n" + "\t\t<UserID>1</UserID>\n" + "\t\t<PostID></PostID>\n" + "\t\t<DptID>1</DptID>\n" + "\t\t<PostName>专员</PostName>\n" + "\t</item>\n" + "</Users>";
            // 调用 Web 服务的方法
            String  correctionUrl = client.checkFileCallBackHY(fileId.toString(), fileBytes, "webservicecallback1", "http://1.119.162.45:8370/cxf/services/lawyeeservice?wsdl", "LawyeeServiceService", otherParaInfo, token);
            // 处理结果
            System.out.println("token------------------: " + token);
            System.out.println("Result from WebService------------------: " + correctionUrl);
            if (StringUtils.contains(fileName,"."+SUFFIX_OFD)) {
                correctionUrl=correctionUrl + "&pluginType=pdf";
            }
            result.setCorrectionUrl(correctionUrl);
        } catch (Exception e) {
            e.printStackTrace();
        }

        return result;
    }
    public static long generateRandomNumberBasedOnTime() {
        // 获取当前时间
        LocalDateTime now = LocalDateTime.now();

        // 提取月、日、时、分、秒
        int month = now.getMonthValue();
        int day = now.getDayOfMonth();
        int hour = now.getHour();
        int minute = now.getMinute();
        int second = now.getSecond();

        // 拼接成一个字符串
        String timeString = String.format("%02d%02d%02d%02d%02d", month, day, hour, minute, second);

        // 使用字符串的哈希值作为随机数的基础
        long hash = timeString.hashCode();
        // 使用 Random 生成一个四位的随机数
        Random random = new Random(hash);
        // 生成 0 到 9999 之间的随机数
        int randomPart = random.nextInt(10000);

        // 将时间部分和四位随机数拼接成一个字符串
        String randomNumberString = timeString + String.format("%04d", randomPart);

        // 将最终的字符串转换为 long 类型
        return Long.parseLong(randomNumberString);
    }
}
